[
  {
    "courseName": " Aerospace Engineering",
    "Branch": " Aeronautical",
    "SimilarCourses": " Aircraft Manufacturing and Maintenance Engineering | Aeronautical Engineering | Aviation Management",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Aerospace%20Engineering.JPG?itok=UyYqRV4x",
    "CourseDef": " Aerospace is a specialised branch of engineering which deals with the design and development of aircraft's as well as space crafts The course curriculum covers aspects of two branches of engineering - aeronautical and astronautical engineering. The course also focuses on new technologies in aviation, defence systems, and space exploration. The course is offered at both undergraduate and postgraduate levels awarding B.Tech and M.Tech degrees.",
    "Eligibility": "For UG: The candidate should have passed 10+2 examination from CBSE or any other equivalent examination board with Physics, Chemistry and Mathematics as core subjects. The candidates should also fulfil minimum qualifying marks in aggregate of the subjects.For PG: The candidate should have a B.Tech degree in aerospace engineering with a minimum passing percentage in the aggregate of the subjects studied at undergraduate level.",
    "Scope": [
      "When the world is designing more cost-effective satellites and space shuttles, it’ll need expert brains to design such machines.",
      "As the world is moving towards commercialisation of space shuttles and rockets, the demand for aerospace engineers is set to increase.",
      "With a number of private players entering into aerospace technology, the opportunities are getting better."
    ]
  },
  {
    "courseName": " Computer Science Engineering",
    "Branch": " Computer Science",
    "SimilarCourses": " Software Engineering | Mathematics and Computing Engineering | Information and Communication Technology | Information Science Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Computer-Science-Engineering1.jpg?itok=EmraS_w5",
    "CourseDef": " Computer science engineering (CSE) is one of the popular courses among engineering aspirants which focuses on the basic elements of computer programming and networking. Students pursuing computer science courses will gain knowledge of design, implementation and management of information system of both hardware and software. Going by the name, CSE course deals primarily with the theory of computation and design of computational systems. The course is offered across the globe in technical institutions at undergraduate as well as postgraduate levels awarding B.Tech and M.tech degrees, respectively.",
    "Eligibility": "For UG: The candidate should have passed 10+2 examination from CBSE or any other equivalent examination board with Physics, Chemistry and Mathematics as core subjects. The candidates should also fulfil minimum qualifying marks in aggregate of the subjects.For PG: The candidate should have a B.Tech degree with a minimum passing percentage in aggregate of the subjects studied at the degree level.",
    "Scope": [
      "The present and future world can’t live without technology and the boom in the technology sector will lead to lucrative opportunities.",
      "Increasing number of software companies and IT hubs like ‘Silicon Valley’ indicate an increasing demand for CSE experts.",
      "Concepts like ‘cloud computing’ upon which future technologies will be based need specialists in this domain."
    ]
  },
  {
    "courseName": " Mechanical Engineering",
    "Branch": " Mechanical",
    "SimilarCourses": " Mechanical and Industrial Engineering | Mechanical and Automation Engineering | Mechanical Production Engineering | Mechanical Automobile",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Mechanical-Engineering2.jpg?itok=H6ORa-0t",
    "CourseDef": " Mechanical engineering is a professional programme which helps students to understand the working mechanisms of heavy tools and machineries.  The branch applies principles of engineering, physics and material science for the design, analysis, manufacturing and maintenance of mechanical systems. The course covers technical areas like distribution of electricity through generators, transformers, transmission lines, lighting and wiring in buildings. A course in mechanical engineering makes a student gain knowledge and experience in the designing of electric motors, automobiles, aircrafts and other heavy vehicles. Mechanical engineering demands knowledge about software used in technical work like computer-aided design and mathematical modelling.",
    "Eligibility": "For UG: Should have passed Class XII in Science stream with minimum 50% marks or equivalent CGPA.For PG: Minimum CPI of 6.5 or 60% of marks or First Class in the qualifying degree. Bachelor's degree in Engineering and Technology.",
    "Scope": [
      "Mechanical Engineering covers aspects like design and testing among others. The job demands supervision and planning of live projects related to thermal power plants, nuclear stations, generation of electricity, etc.",
      "There are employment opportunities for diploma holders who have practical knowledge of working on fields like testing of machinery etc.",
      "The emerging fields in this area include renewable energy, automobiles, quality control, Industrial Automation, Mechanobiology. These are going to increase manpower in the work profile of mechanical engineering and would offer employment opportunities.  "
    ]
  },
  {
    "courseName": " Electrical Engineering",
    "Branch": " Electrical",
    "SimilarCourses": " Electrical and Instrumentation Engineering | Electrical and Communications Engineering | Power Engineering | Electrical and Electronics Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Electrical%20Engg.jpg?itok=u_MsHCru",
    "CourseDef": " Electrical engineering, one of the core courses of engineering discipline deals with the study of design, development, and maintenance of electrical systems and their components, ensuring quality, safety, reliability, and sustainability. The course focuses on the manufacturing of electrical equipment used in a number of sectors including construction and building and the production and distribution of power. Students pursuing electrical engineering study about semiconductors and microprocessors. The undergraduate course will award a B.Tech / B.E. degree and the postgraduate course, an M.Tech.",
    "Eligibility": "For UG: The candidate should have passed 10+2 examination from CBSE or any other equivalent examination board with Physics, Chemistry and Mathematics as core subjects. The candidates should also fulfil minimum qualifying marks in aggregate of the subjects.For PG: The candidate should have a B.Tech degree with a minimum passing percentage in an aggregate of the subjects studied at the degree level.",
    "Scope": [
      "Electrical engineering is rapidly growing not only within core areas such as wireless communications and mobile technologies but also in other cross-functioning areas including nanotechnology and biomedical engineering.",
      "The world is moving towards the renewable source of energy including hydel, solar and wind power, and multi-national corporations are searching for power generation experts."
    ]
  },
  {
    "courseName": " Civil Engineering",
    "Branch": " Civil",
    "SimilarCourses": " Civil and Structural Engineering | Building and Construction Engineering | Civil Environmental Engineering | Construction Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Civil%20Engineering_0.jpg?itok=It7teLg2",
    "CourseDef": " There would have been no historic wonders like Taj Mahal, Coliseum of Rome and the Great Wall of China or modern masterpieces like the London Bridge and Howrah Bridge if there were no civil engineers. The engineering course deals with planning, designing, constructing, maintaining, and operating infrastructures while protecting the public and environmental health as well as improving existing infrastructure. The course also teaches the development of better infrastructural facilities to sustain an eco-friendly environment. Civil engineering course is offered both at the undergraduate and postgraduate levels.",
    "Eligibility": "For UG: The candidate should have passed 10+2 examination from CBSE or any other equivalent examination board with Physics, Chemistry and Mathematics as core subjects. The candidates should also fulfil minimum qualifying marks in aggregate of the subjects.For PG: The candidate should have a B.Tech in civil engineering with a minimum passing percentage in an aggregate of the subjects studied at undergraduate level.",
    "Scope": [
      "The construction and infrastructural development projects including town planning are on the rise in the coming days and will demand more domain specialists.",
      "In search of comfortably safe homes, better roads and standardised living, the demand for civil engineers are to raise more."
    ]
  },
  {
    "courseName": " Electronics and Communication Engineering",
    "Branch": " Electronics",
    "SimilarCourses": " Power Electronics | Electronics Product Design Technology | Electronics and Power Engineering | Electronics and Media Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Electronicsand%20Communication%20Engineering.jpg?itok=nuxEKBcX",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Information Technology",
    "Branch": " Computer Science",
    "SimilarCourses": " Software Engineering | Mathematics and Computing Engineering | Information and Communication Technology | Information Science Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Information%20Technology_0.jpg?itok=BIUV2Fac",
    "CourseDef": " A student holding a degree in Information Technology can work as an IT Engineer responsible for operating computer systems, software, servers, computer networking or network securities. The programme focuses on the theoretical and technical aspects of designing, developing, researching and testing software as well as digital hardware. Information Technology is designed to teach students about various fundamental concepts of information security, web systems, computer networking and software engineering. The programme covers subjects like programming, mathematics, and operations among others.",
    "Eligibility": "For UG: Candidates passed in class 12th examination with minimum qualifying marks.For PG: For Candidate holding Bachelor of Engineering or B.Tech in Information Technology or B.E./ B. Tech  ",
    "Scope": [
      "Work in IT-sectors as an IT-Consultant, Business Analyst, Information System Manager, System Developer, Database Administrators, Hardware Engineers, System Testers.",
      "Companies includes software development consultancies, BPO (business process outsource), software management and online services.",
      "Work as creative problem solvers.",
      "Emerging companies offer great packages for IT engineers."
    ]
  },
  {
    "courseName": " Aeronautical Engineering",
    "Branch": " Aeronautical",
    "SimilarCourses": " Aircraft Manufacturing and Maintenance Engineering | Aerospace Engineering | Aviation Management",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Aeronautical%20Engineering.JPG?itok=t24BJ9BR",
    "CourseDef": " Aeronautical engineering is a study about the design and systems of an aircraft. It involves practical and theoretical understanding of materials, assembling parts, testing and maintenance of aircrafts. Professional engineers working in this domain have to be licensed aeronautical engineers. The course also enables students to attain knowledge of advanced technology used in aircrafts travelling in outer space. Aeronautical engineering also covers disciplines like aerodynamics, avionics and propulsion among others. Students pursuing aeronautical engineering can explore opportunities in defence organisations, government research centres, aircraft manufacturing organisations and NASA.",
    "Eligibility": "For UG: Class XII pass-out from a recognised school.For PG: B.Tech degree in the given areas: Aerospace, Aeronautical, Mechanical, Automobile, Chemical, Naval Architecture, Electrical, Electronics, Metallurgy & Material Science, Instrumentation, Mechatronics etc.",
    "Scope": [
      "There is a lot of scope in government organisations including defence.",
      "Aeronautical engineers can have earned well in private MNCs",
      "There are opportunities to work with NASA after completing higher studies in this stream."
    ]
  },
  {
    "courseName": " Automobile Engineering",
    "Branch": " Automobile",
    "SimilarCourses": " Automotive Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Automobile%20Engineering_2.jpg?itok=Y5BiLfxj",
    "CourseDef": " Automobile Engineering or Automotive Engineering is a part of Mechanical Engineering. Through the application of automotive technology, the course offers specialisation in vehicle designing, repairing, testing and assembling. In this programme, one can also learn safety engineering, quality management and control, automotive analytics as well as assembling and installation of various automobiles. BE/B.Tech in Automobile Engineering is a 4-year programme.This programme also involves the study of courses related to aerospace and marine engineering. It enables the students to explore new areas, create new avenues in the fields of research and development of technologies in the field of automobile engineering. One can pursue M.Tech in Automobile Engineering after successful completion of BE/B.Tech.",
    "Eligibility": "UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry and Mathematics as core subjects. Besides national-level test like JEE, Independent entrance tests for Automobile Engineering are also held by various state, central, and private universities which mostly require 50% in qualifying exam as the prerequisite to appear for the testPG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Mechanical Engineering/Automobile Engineering along with a good score in entrance tests held for PG programme held by the various state, central, and private universities or national-level test like GATE.",
    "Scope": [
      "As Design Engineers, automobile engineers design the intricate details of the hydraulic, electrical, and mechanical systems inside a vehicle.",
      "As Development Engineers, they are involved in the development, implementation, operation, maintenance, and control of all processes in the manufacture of vehicles.",
      "As quality control executive, they work towards improving the efficiency of existing vehicles and developing new ones."
    ]
  },
  {
    "courseName": " Automation and Robotics",
    "Branch": " Others",
    "SimilarCourses": " Systems Science Engineering | Plastic Engineering | Water Management | Rubber Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Automation-and-Robotics2.jpg?itok=MBdZTP9M",
    "CourseDef": " If you fantasised about designing a ‘RoboCop’ or were awe-struck with ‘Iron Man’ powers; you may have an inclination towards pursuing automation and robotics course. Automation and robotics is a specialised engineering branch that provides in-depth knowledge in the areas concerning electro-mechanics, robotic sensors, automatic system and artificial intelligence. The course also deals with designing robots, maintaining them, developing new applications and research in the automation system. Concepts like auto-driven cars are the genesis of automation and robotics course.",
    "Eligibility": "For UG:  The candidate should have passed 10+2 examination from CBSE or any other equivalent examination board with Physics, Chemistry and Mathematics as core subjects. The candidates should also fulfil minimum qualifying marks in aggregate of the subjects.For PG: The candidate should have a B.Tech degree with a minimum passing percentage in an aggregate of the subjects studied at undergraduate level.",
    "Scope": [
      "Increasing demand for quality products and services at low cost has led industries towards automation and robotics engineering.",
      "In near future, robotics and automatic systems will be replacing human labour force in a number of hazardous places including mining.",
      "The industry requires specialised workforce to replace manual labourers who will be in charge of the automated machines and robots."
    ]
  },
  {
    "courseName": " Electrical and Electronics Engineering",
    "Branch": " Electrical",
    "SimilarCourses": " Electrical and Instrumentation Engineering | Electrical and Communications Engineering | Power Engineering | Electrical Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Electrical%20and%20Electronics%20Engineering.jpg?itok=Chd3RA1O",
    "CourseDef": " Electrical and electronics engineering is a branch of science which deals with the applications of electricity, electronics, and electromagnetism. The course diversifies into various fields like the multimedia programmer, technical sales engineer, and project manager. It focuses on giving students practical training to work in laboratories, project and group work. These engineers are responsible for designing, developing and testing electrical equipment. The work profile after completing the course includes designing electronic components apart from software and network system. Students pursuing the course may explore career options in various domains like engineering works, construction, information technology, etc.",
    "Eligibility": "For UG:  Class XII pass out with Physics, Chemistry and Mathematics as compulsory subjects.For PG: Undergraduate in mechatronics engineering from a recognised university.",
    "Scope": [
      "The popularity of “Digital India” has increased the scope of undergraduate and postgraduate programmes in Electrical and Electronics engineering.",
      "A rise in industrialisation and privatisation across the globe has increased the scope of the course."
    ]
  },
  {
    "courseName": " Electrical and Communications Engineering",
    "Branch": " Electrical",
    "SimilarCourses": " Electrical and Instrumentation Engineering | Power Engineering | Electrical Engineering | Electrical and Electronics Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Electrical%20and%20Communications%20Engineering2.jpg?itok=QLAOnrXp",
    "CourseDef": " Electrical and Communications is a discipline within electrical engineering. The course involves study of application of mathematical and scientific principles to design and integrate electrical and electronics systems. The course also includes the study of mechanism involved in generation of electrical power. Students also learn about development and operation of communication technology. The course includes telecommunication and computer programming apart from core subjects like electronics engineering, telecommunications engineering, laser and optical engineering and integrated circuit design. Completion of postgraduate and undergraduate degrees in Electrical and Communications engineering opens doorways for students to work in different job profiles like service engineers, software analyst, network planning engineer and field test engineer.",
    "Eligibility": "For UG: Candidates belonging to General category should secure minimum aggregate marks as 60% in Class XII or equivalent examination. Candidates belonging to SC/ST/PWD should secure minimum aggregate marks as 55% in Class XII or equivalent examination.   For PG:  - Candidates belonging to General category should secure minimum aggregate marks as 60%. Candidates belonging to SC/ST should secure minimum aggregate marks as 55% in B.E./B.Tech degree conducted by a recognised University.   Or Candidates holding an IIT B.Tech degree should secure CGPA/CPI score of 8.00 (on 0-10 scale).",
    "Scope": [
      "There has been a wide use of digital signal processing and image processing due to increasing in the number of research projects led by government agencies like DRDO, Naval Research, and Army Technology Board.",
      "This has increased the scope of job intakes for profiles like service engineers, network planning engineer and field test engineer."
    ]
  },
  {
    "courseName": " Architecture Engineering",
    "Branch": " Architecture",
    "SimilarCourses": "",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Architecture%20Engineering.jpg?itok=g7SK4xFQ",
    "CourseDef": " Architecture primarily teaches you the art of designing houses, skyscrapers, office spaces, shopping centres, malls and hotels. It is one of the unique courses as it has a combination of culture, design, and science and technology. Architecture programmes are creative in nature and it blends technology with arts. The course not only imparts knowledge about designing structures but also teaches you the concept of planning. Pursuing an undergraduate course in architecture will award you with B.Arch degree while an M.Arch degree at the postgraduate level.",
    "Eligibility": "For UG: The candidate should have passed 10+2 examination from CBSE or any other equivalent examination board with Physics, Chemistry and Mathematics as core subjects. The candidates should also fulfil minimum qualifying marks in aggregate of the subjects.For PG: The candidate should have a B.Arch degree with a minimum passing percentage in aggregate of the subjects studied at the degree level.",
    "Scope": [
      "With the development in infrastructure sectors, the world will need architects for planning and designing the blueprint of the building or the projects.",
      "No major infrastructural project can be passed without any prior architectural design.",
      "Globalisation and Privatisation have led to the planning of more infrastructural projects which in turn will need more domain experts."
    ]
  },
  {
    "courseName": " Mechatronics Engineering",
    "Branch": " Mechanical",
    "SimilarCourses": " Mechanical and Industrial Engineering | Mechanical and Automation Engineering | Mechanical Production Engineering | Mechanical Automobile",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Mechatronics-Engineering2.jpg?itok=p1oqa3_i",
    "CourseDef": " Mechatronics Engineering is the branch of science which includes the study of mechanical engineering, electronics engineering, computer engineering, telecommunications, system engineering and control engineering. It focuses on different aspects of mechatronics like modelling, real-time computer interfacing, sensors, controllers and actuators. After completing the course graduates can work on different aspects like sensing and control systems, automation and robotics, artificial intelligence and expert systems, transportation and vehicular systems and computer integrated manufacturing systems. Being a specialised field, undergraduate and postgraduate engineering courses in Mechatronics are offered by few technical colleges.",
    "Eligibility": "For UG: Class XII pass out with Physics, Chemistry and Mathematics as compulsory subjects.For PG: Undergraduate in mechatronics engineering from a recognised university.",
    "Scope": [
      "A rise in the application of medical imaging system in health care centres and research centres have increased the work profile of postgraduate engineers in Mechatronics.",
      "LaThe launch of different space shuttles has increased opportunities for Mechatronics graduates."
    ]
  },
  {
    "courseName": " Electronics and Computer Engineering",
    "Branch": " Electronics",
    "SimilarCourses": " Power Electronics | Electronics Product Design Technology | Electronics and Power Engineering | Electronics and Media Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Electronics%20and%20Computer%20Engineering.jpg?itok=HtPXaaH8",
    "CourseDef": " Electronics and Computer Engineering is a branch of Electronics Engineering which deals with the effects of electrons to build components, devices, systems, or equipment. Electrical Engineering basically deals with the study and application of electricity, electronics, and electromagnetism. A bachelor's program in Electronics and Computer Engineering gets you a B.Tech degree in Electronics and Computer Engineering.\nComputer engineering deals with the design of computers and computer systems. This may involve the design of new hardware or software. Computer engineers may also work on a system's software. However, the design of complex software systems is often the domain of software engineering, which is usually considered a separate discipline. Electronics and Computer engineering is the integration of electrical engineering and computer science to develop computer systems. The computer engineers are involved in hardware and software aspects of computing. Master's degree in Electronics and Computer Engineering earns you an M.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry and Mathematics as core subjects. Independent entrance tests are also held by various state, central, and private universities which mostly require 50% as the prerequisite to appear for the testFor PG: Candidates must hold a degree in Bachelor of Engineering/ B. Tech in Electronics and Computer Engineering along with a good score in entrance tests held for PG programme held by the various state, central, and private universities.",
    "Scope": [
      "An electronic engineer can find a job in the consumer electronics manufacturing organisation, telecommunication and IT industry, healthcare equipment manufacturing organisation, mobile communication(2G,3G,4G), internet technologies, and power electronics industry.",
      "Electrical Technicians and Technologists can specialize in technical sales, product representation, systems management, the design and manufacture of electronic devices and systems, or the installation, maintenance and repair of electronic systems and equipment.",
      "They may also work with computers and electronic equipment in the medical, manufacturing, industrial control, telecommunications, aeronautical and military fields."
    ]
  },
  {
    "courseName": " Chemical Engineering",
    "Branch": " Chemical",
    "SimilarCourses": " Petrochemical Engineering | Chemical Ceramic Technology | Chemical and Polymer Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Chemical%20Engineering1.jpg?itok=_F4JWeqF",
    "CourseDef": " Chemical Engineering deals with the design, development of processes and operation of machines and plants through which the physical or chemical state of materials undergo various changes. Founded on the principles relating to chemistry, physics, and mathematics, Chemical Engineering finds application in process industries. BE/B.Tech in Chemical Engineering is a 4-year program.\nDevelopments in chemical practices have led to more advanced fields like Nanotechnology, Bio-Engineering, Bio-Molecular Engineering, Material processing etc. It finds global application in everyday life. Modern innovations like human genome project, genetic engineering, and DNA sequencing has changed the face how chemical engineering was earlier perceived. One can do an M.Tech in Chemical Engineering after BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Mathematics as core subjects. Independent entrance tests for this programme are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech along with a good score in entrance tests held for PG programme held by the various state, central, and private universities. Candidates with an MSc degree in chemistry are also eligible for the M.Tech programme in Chemical Engineering.",
    "Scope": [
      "Chemical Engineers play a significant role in the advancement of systems that depend upon material response for their functioning.",
      "They also know how to predict and tailor the outcomes of chemical reactions and synthesise chemicals.",
      "The industry offers multiple roles for skilled professionals"
    ]
  },
  {
    "courseName": " Electronics and Telecommunication Engineering",
    "Branch": " Electronics",
    "SimilarCourses": " Power Electronics | Electronics Product Design Technology | Electronics and Power Engineering | Electronics and Media Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/2013/11/20/8-Electronics%20and%20Telecommunications%20Engineering_0.jpg?itok=wnokWKnL",
    "CourseDef": " Electronics and Telecommunication Engineering is a study of various principles and practical aspects related to the designing various telecommunications equipment. Electronics and Telecommunication Engineers develop prototypes of integrated circuit components. B.Tech/BE trains students in dealing with the performance of telecommunication systems. BE/B.Tech in Electronics and Telecommunication Engineering is a 4-year program.\nSome of the electives that reputed institutes offer under this course include Digital Logic Design, Semiconductor Devices, Network Theory, Signals, and Systems; Analog Circuits, Communication Systems, and Techniques Engineering Electromagnetics. Besides this one can opt for Principles of Digital Communication, Microwave Engineering or Digital Signal Processing. One can pursue M.Tech in Electronics and Telecommunication Engineering after successful completion of BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, and Mathematics as core subjects. Independent entrance tests are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Electronics and Communication Engineering/Electrical Engineering along with a good score in entrance tests held for PG program held by the various state, central, and private universities.",
    "Scope": [
      "Graduates/postgraduates can work in the consumer electronics, aviation and avionics, manufacturing, electricity generation and distribution, communications, transportation, telecommunications industry as electronics engineers.",
      "Engineers also work on cross functional engineering branch projects to utilise the facets of electronics and communication engineering.",
      "They also work on improving the functionality and technology of communication devices and servers.",
      "Setting up networks and equipment and maintain the systems are also among their job profile."
    ]
  },
  {
    "courseName": " Aircraft Manufacturing and Maintenance Engineering",
    "Branch": " Aeronautical",
    "SimilarCourses": " Aerospace Engineering | Aeronautical Engineering | Aviation Management",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Aircraft%20Manufacturing%20and%20Maintenance%20Engineering1.jpg?itok=Siq1J4Ts",
    "CourseDef": " The aircraft manufacturing and maintenance engineering programme deals with testing, overhauling, construction, manufacturing and maintenance and repair of aircrafts and their components. While pursuing the course in Aircraft Manufacturing and Maintenance Engineering, the students would learn how to operate and maintain the helicopters and the aircrafts in terms of operation of engines, its structure and systems. They would also be taught how to use engine trend analysis so that they could plan well ahead in advance for regular inspections. Training would be imparted about the maintenance of various components as this will help in the reduction of downtime of flying vehicles. On completion of the course, the students would know about the civil aviation rules and regulations related to the light and heavy aircraft",
    "Eligibility": "For UG: Students planning to take up a career in aviation engineering need to have passed 10+2 examination from a recognised board with Physics & Mathematics as major subjects.For PG: Students planning to pursue Masters in Aircraft Manufacturing and Maintenance Engineering must have cleared their bachelor’s degree in Aeronautical Engineering/ Mechanical Engineering with first class or its equivalent.",
    "Scope": []
  },
  {
    "courseName": " Petroleum Engineering",
    "Branch": " Petroleum",
    "SimilarCourses": " Paint Technology | Oil and Paint Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Petroleum%20Engineering.jpg?itok=ykaRwgFO",
    "CourseDef": " Petroleum Engineering is a branch of science which deals with the study of extraction of crude oil and natural gas present on the deposits found below the surface of Earth. Students pursuing undergraduate and postgraduate degrees in Petroleum Engineering study about the designing aspect of oil and gas reservoirs used for storage and transportation. The course also makes them aware of the procedure required in drilling the surface of the earth for refining petroleum products.",
    "Eligibility": "For UG: Minimum aggregate marks as 60% in Class XII with subjects as Physics, Chemistry and Mathematics.For PG: B.Tech in Petroleum Engineering.",
    "Scope": [
      "The scope of different industries investing in the petroleum sector and collaboration with foreign investors has increased the recruitment drives for petroleum engineers.",
      "The expansion of oil refineries on partnerships of government agencies with private organisations.    "
    ]
  },
  {
    "courseName": " Information and Communication Technology",
    "Branch": " Computer Science",
    "SimilarCourses": " Software Engineering | Mathematics and Computing Engineering | Information Science Engineering | Information Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Information-and-Communication-Technology1.jpg?itok=y6Y7u2Bb",
    "CourseDef": " The program is designed for students aspiring to develop cutting-edge technology in the field of Information and Communication. Students are taught about communications systems under which they get to know about radar systems, wireless system design, computational electromagnetics. The other aspects which students would get to know are related to satellite communications and telecommunication system since mobile phones and the internet have penetrated every sphere of our life. Hence, it is important to ensure that students are aware of the latest developments that are taking place in this field. Students get to know as to how to provide immediate connectivity through voice, visual and data.",
    "Eligibility": "For UG: Students aspiring to take up Bachelor of technology in information and communication technology need to have passed their 10+2 examination with Physics, Chemistry, and Mathematics.For PG: Those candidates who are planning to take up masters in Information and Communication Technology need to have passed bachelor of engineering and bachelor's of technology in Information and Communication Technology, Computer Science, Electronic Engineering.",
    "Scope": []
  },
  {
    "courseName": " Biotechnology Engineering",
    "Branch": " Life Sciences",
    "SimilarCourses": " Micro-Biology and Immunology Engineering | Genetic Engineering | Electronics and Biomedical Engineering | Bio Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Biotechnology%20Engineering.jpg?itok=AmGbP1D3",
    "CourseDef": " Biotechnology engineering is the study, research and development of bio-organism, micro-organism and cell functions in living beings. The course combines engineering with other subjects like chemistry, genetics, bio-chemistry and microbiology. Biotechnology covers different fields of work like agriculture, disease research, eco-conservation, fertilizers, vaccines, energy production and animal husbandry. The programme focuses on areas like Enzymology, GM products and drug designing among others. The integrated undergraduate and postgraduate programme in biotechnology engineering is offered in many technical institutes across the world.",
    "Eligibility": "For UG: Class XII pass out from a recognised school with minimum aggregate marks of 60%.For PG: Engineering graduates with a B.tech degree.",
    "Scope": [
      "Students with Biotechnology degrees can work as laboratory technicians in various research centres, hospitals, healthcare centres and universities.",
      "Many pharmaceutical companies hire postgraduates in biotechnology as research scientists.",
      "The rise in the production of genetically modified crops has increased the demands in the market. This has increased the scope of employment for students pursuing Biotechnology."
    ]
  },
  {
    "courseName": " Electronics and Instrumentation Engineering",
    "Branch": " Electronics",
    "SimilarCourses": " Power Electronics | Electronics Product Design Technology | Electronics and Power Engineering | Electronics and Media Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Electronics%20and%20Instrumentation%20Engg.jpg?itok=VQEqMpE3",
    "CourseDef": " Electronics and Instrumentation Engineering has come to acquire a great deal of significance as today, in our day to day lives we are increasingly using tools, appliances, and instruments which contain electronic components. Those candidates who are planning to pursue this program are provided training in the field of electronic controls and communications engineering, electrical machines, semiconductor devices. They also learn about digital control, virtual instrumentation, neural network and fuzzy logic, data communication and networks, digital signal processing, IC fabrication technology. Students are trained to study robotics, computer control in process application, biomedical, computer-assisted measurements and the latest techniques related to instrumentation.",
    "Eligibility": "For UG: Students who are planning to pursue their bachelor's in Electronics and Instrumentation Engineering need to have passed their 10+2 in science stream with Physics, Chemistry, Maths and Biology from a recognised board.For PG: Candidates who are planning to pursue their master of technology or master of engineering in Electronics and Instrumentation Engineering need to have cleared their Bachelor of Engineering, Bachelor of Technology in Electrical and Electronics Engineering, Electrical Engineering, Electronics and Instrumentation Engineering.",
    "Scope": []
  },
  {
    "courseName": " Electronics Engineering",
    "Branch": " Electronics",
    "SimilarCourses": " Power Electronics | Electronics Product Design Technology | Electronics and Power Engineering | Electronics and Media Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Electronics%20Engineering.jpg?itok=Xsz4Vwrf",
    "CourseDef": " Electronics Engineering is a branch of electrical engineering. The discipline studies the use of electromagnetic spectrum in a broad way and is related to the application of electronic devices like integrated circuits, transistors etc. It also deals with the design and application of circuitry and equipment for power generation and distribution, machine control, and communications. Students learn to design electronic circuits, computer systems and also develop control systems. BE/B.Tech in Electronics Engineering is a four-year program.\nThe sub-disciplines of Electronics Engineering include power, control, electronics, microelectronics and Signal Processing, Telecommunications, Instrumentation, and Computers. One can pursue M.Tech in Electronics Engineering after successful completion of BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, and Mathematics as core subjects. Independent entrance tests are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/ B. Tech in Electronics and Communication Engineering along with a good score in entrance tests held for PG program held by the various state, central, and private universities.",
    "Scope": [
      "Graduates/postgraduates can work as Production Managers and can manage design engineers, purchase division and others involved in the production process.",
      "Electronics Engineers also design and develop control systems.",
      "They also look after project management in terms of cost and time as well as optimisation of resources.",
      "They resolve problems with the existing machinery/ processes.",
      "They can also work as a Health and Safety Officer with manufacturing units to ensure compliance.",
      "As quality officers, they ensure quality standards of electronics."
    ]
  },
  {
    "courseName": " Automotive Engineering",
    "Branch": " Automobile",
    "SimilarCourses": " Automobile Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Automotive-Engineering1.jpg?itok=ui7wLBvv",
    "CourseDef": " Automotive engineering is meant for those who have a passion for cars. Those taking up this course will get to learn about the application of mechanical, thermodynamic, pneumatic, hydraulic and electrical principles with an aim to resolve engineering problems. During the period of their study, they will get to know as to how to design and produce visual interpretations of the automobiles and their components. They would also be involved in developing test procedures as well as conducting tests by using physical testing methods and software packages. Another interesting aspect of the course is that students would also get an opportunity to supervise and inspect the installation, modification, and commissioning of mechanical systems at the industrial facilities or plants.",
    "Eligibility": "For UG: Students who have passed 10+2 from science stream, having Physics, Chemistry and Mathematics are eligible to take up the examination.For PG: Open to students who have passed graduation examination in automotive engineering/Bachelor in Technology in Automotive from recognised university.",
    "Scope": []
  },
  {
    "courseName": " Applied Electronics and Instrumentation Engineering",
    "Branch": " Electronics",
    "SimilarCourses": " Power Electronics | Electronics Product Design Technology | Electronics and Power Engineering | Electronics and Media Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Applied-Electronics-and-Instrumentation-Engineering2.jpg?itok=PmHIO_Zg",
    "CourseDef": " Applied Electronics and Instrumentation Engineering has gained significant importance in the past few years. The electronics and instrumentation engineers are taught about the designing aspect of analog and digital electronic devices. These devices are primarily used for measurement and control of parameters such as flow, pressure, temperature, and level, and the calibration of such instruments. The other type of instruments which students learn to make, include seismic sensors, blood glucose sensors, fire detectors, and ampere meters. A large number of these devices are used for increasing the productivity as well as the reliability. There are many educational institutions, which offer courses in signals, systems, and control theory.",
    "Eligibility": "A student opting to pursue Bachelor of Technology in Applied Electronics and Instrumentation Engineering should have passed his 10+2 from the science stream from a recognized board. He should have had Physics, Chemistry, and mathematics in his class 12th.",
    "Scope": []
  },
  {
    "courseName": " Agricultural and Food Engineering",
    "Branch": " Agricultural",
    "SimilarCourses": " Agricultural and Irrigation Engineering | Agricultural Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Agricultural-and-Food-Engineering2.jpg?itok=jnvaPhx-",
    "CourseDef": " Agriculture is the root of our livelihood as the cultivation of soil not only results in the yielding of crops, it provides food to the animals also. In wake of the various technological advancements that are taking place in the sector, agricultural and food engineering has come to acquire a great deal of importance. Under the programme, the students would get to study as to how to develop technology that could be effectively used in the sphere of land resource planning, crop production, irrigation, dairy engineering. Meanwhile, the food engineers would be engaged in production, processing, packaging, safety and/or transportation of the world’s food supply. They would also get an opportunity to study about food refrigeration, freezing, thermal processing, drying, and other food operations",
    "Eligibility": "Students having Physics, Chemistry, Mathematics and/or Biology in their 10+2 are eligible for the entrance examinations that are conducted for admission to B.E./B.Tech programs in agricultural engineering.",
    "Scope": []
  },
  {
    "courseName": " Petrochemical Engineering",
    "Branch": " Chemical",
    "SimilarCourses": " Chemical Ceramic Technology | Chemical and Polymer Engineering | Chemical Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Petrochemical%20Engineering1.jpg?itok=ZlPt8WEV",
    "CourseDef": " Petrochemical engineering is a branch of Chemical Engineering which deals with operations involved in refining petroleum or crude oil by the use of advanced technology. The course also includes extraction of crude petroleum obtained from the core of earth. Students learn about the mechanism and techniques involved in activities like exploration, production and exploitation of oil or natural gases. After the completion of undergraduate and postgraduate programmes in petroleum engineering, students can work in job profiles like petroleum geologists, drilling engineers, reservoir engineers and production engineers.",
    "Eligibility": "For UG: Candidates must be Class XII passed out from a recognised institute.For PG: Candidates must have completed B.Tech in Petrochemical Engineering from a recognised AICTE institute.",
    "Scope": [
      "The collaboration of government and private firms with international investors and oil companies in gulf countries has increased employment opportunities for pass outs in petrochemical engineering.",
      "There are multinational companies based in UAE offering good salary packages to experienced employees in job profiles of petroleum geologists, drilling engineers, reservoir engineers and production engineers   "
    ]
  },
  {
    "courseName": " Building and Construction Engineering",
    "Branch": " Civil",
    "SimilarCourses": " Civil and Structural Engineering | Civil Environmental Engineering | Construction Technology | Construction Technology and Management",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Building%20and%20construction%20Engineering.jpg?itok=DmKTOjKS",
    "CourseDef": " Building and Construction Engineering deals with designing, planning, construction and management of infrastructure. It would include buildings, roads, bridges, dams, roads, railways etc. The course combines some aspects of Civil Engineering as well as that of Construction Management. The 4-year program earns you a B.Tech or B.E in Building and Construction Engineering.\nThe major difference between Civil Engineering and Construction Engineering is that the former concentrates more on the design work, gearing students towards a career as a design professional. This essentially requires them to take a multitude of construction design courses. It also allows them to understand both the design functions as well as the building requirements needed to design and build structures. One can pursue M.Tech in Building and Construction Engineering after successful completion of undergraduate studies.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Mathematics as core subjects. Independent entrance tests for this programme are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Building and Construction Engineering/Civil Engineering along with a good score in entrance tests held for PG programme held by the various state, central, and private universities.",
    "Scope": [
      "Construction engineers hold supervisory or administrative positions ranging from supervisor of a construction site to the city engineer, public works director, and city manager.",
      "Graduates and postgraduates work as structural engineers who design and assess major projects, such as the construction of buildings, bridges, or dams, to ensure their strength and durability.",
      "As transportation engineers, they plan, design, operate and maintain everyday systems, such as streets and highways.",
      "Building and Construction Engineers are often hired as Division Head, Project Manager, Supervisory Engineer, Consultants, Director of Public Works, and Quality Analysts."
    ]
  },
  {
    "courseName": " Nuclear Engineering",
    "Branch": " Others",
    "SimilarCourses": " Systems Science Engineering | Plastic Engineering | Water Management | Rubber Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Nuclear%20Engineering2.jpg?itok=tCSYtEWK",
    "CourseDef": " Nuclear engineering program prepares students to take up careers in the field of low-energy nuclear physics. In the nuclear energy program, students are taught about the fundamentals of nuclear processes such as radiation measurement, their production, and interactions. Students also get to learn about radiation treatment and imaging for medical and industrial applications as well as radiation detection and measurement. Students acquire knowledge about the execution of plans with an aim to make the nuclear reactors more efficient and effective.",
    "Eligibility": "Those planning to pursue master in Nuclear Engineering need to have cleared Bachelor of Technology or Bachelor of Engineering in Mechanical, Chemical, Electrical, Electronics.",
    "Scope": []
  },
  {
    "courseName": " Electronics Control Systems Engineering",
    "Branch": " Electronics",
    "SimilarCourses": " Power Electronics | Electronics Product Design Technology | Electronics and Power Engineering | Electronics and Media Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Electronics-Control-Systems-Engineering1.jpg?itok=CMv7DIGO",
    "CourseDef": " With the increase in usage of digital technology, the requirement for electronics control systems engineers has increased in order to resolve various issues related to digital control systems. Under the program, students get to study about the impact of electrons that are required to make equipment, device, and systems. The course covers electromagnetic field theory, digital logic design, and application. Engineering graduates would acquire knowledge about microelectronic fabrication, power electronics, microelectromechanical systems and control systems engineering, radar systems, remote sensing and microwave electronics. The areas on which budding engineers would gain knowledge include power electronics and devices, artificial intelligence and nanoelectronics technology.",
    "Eligibility": "For UG: Candidates need to have passed 10+2 from a recognised board with maths, physics, and chemistry.For PG: Students planning to pursue their masters in Electronics Control Systems are required to have passed bachelor of engineering, bachelor of technology in electrical engineering, electronic engineering, electrical and electronics engineering, Electrical and Communications Engineering, Electrical and Instrumentation Engineering.",
    "Scope": []
  },
  {
    "courseName": " Electronics and Power Engineering",
    "Branch": " Electronics",
    "SimilarCourses": " Power Electronics | Electronics Product Design Technology | Electronics and Media Technology | Electronics Control Systems Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Electronics%20and%20Power%20Engineering2.jpg?itok=Asxz3ZPE",
    "CourseDef": " Electronics and Power Engineering is a branch of Electrical Engineering. It deals with the generation, transmission, and distribution of electric power and electrical devices connected to such systems including generators, motors, and transformers. It also teaches the principles and practical aspects of converting electrical power from one form to another. BE/B.Tech in Electronics and Power Engineering is a 4-year program.\nElectronics and Power Engineering also teaches students how power electronics system and renewable energy resources will improve and transform electric power systems. One can pursue M.Tech in Electronics and Power Engineering after successful completion of BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, and Mathematics as core subjects. Independent entrance tests are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Electronics and Communication Engineering/Electrical Engineering along with a good score in entrance tests held for PG program held by the various state, central, and private universities. ",
    "Scope": [
      "Graduates/postgraduates in power electronics are actively hired in entertainment sector, consumer electronics industry and also in manufacturing units of signalling equipment and radar control equipment.",
      "Government sector provides numerous job openings for M.E in Power Electronics and drives professionals.",
      "They are also mostly engaged in hardware manufacturing firms and also in power companies abroad.",
      "Following are the job types that are available for graduates/post-graduates in Power Engineering:"
    ]
  },
  {
    "courseName": " Industrial Design",
    "Branch": " Production",
    "SimilarCourses": " Production Engineering and Management | Industrial Engineering | Production Engineering | Industrial and Production Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Industrial-Design1.jpg?itok=HMjoljLt",
    "CourseDef": " Industrial design trains one to blend applied art and applied science in order to improve a product in terms of its visual aspects, applicability, and usage. An industrial designer learns to work on designs that are beneficial both for market and the customers. BE or B.Tech in Industrial design is a four-year programme.In the market of competition and survival of the best, it is very important to design something that looks good, usable and fit to suit the purpose of a customer, and all these at a low cost. Almost every marketing and production industry need skilled people who can read the need of the customer and design products accordingly to deliver them cost effective, useful products. Industry, design or architectural studios also look for graduates from this stream. One can pursue M.Tech in Industrial design after successful\ncompletion of BE/B.Tech.",
    "Eligibility": "For UGCandidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Mathematics as core subjects. Independent entrance tests for this programme are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PGCandidates must hold a degree in Bachelor of Engineering/B.Tech in Mechanical Engineering/Industrial Design along with a good score in entrance tests held for PG programme held by the various state, central, and private universities.",
    "Scope": [
      "Industrial design engineers are actively involved in designing, modelling, testing and producing prototypes.",
      "They also work alongside engineers and model-makers, and industrial/product designers to conduct research and devise a design proposal for projects.",
      "Postgraduates can appear for NET and can teach Industrial Design in universities."
    ]
  },
  {
    "courseName": " Civil and Structural Engineering",
    "Branch": " Civil",
    "SimilarCourses": " Building and Construction Engineering | Civil Environmental Engineering | Construction Technology | Construction Technology and Management",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Civil%20and%20Structural%20Engineering1.jpg?itok=rx7VKNta",
    "CourseDef": " Civil and Structural Engineering is a specialization of the broad domain of Civil Engineering. It can be studied as a separate discipline as well. Civil and Structural Engineering deals with the analysis and design of structures. They include buildings, bridges, towers, flyovers, tunnels, offshore structures like oil and gas fields in the sea, aerostructure and other structures that support or resists the load. Civil and structural engineers design buildings and non-building structures or machinery, equipment, vehicles etc. BE/B.Tech in Civil and Structural Engineering is a 4-year program.\nStructural engineers take into consideration the required strength and stability of structures. Structural engineering design utilizes a number of simple structural elements to build complex structural systems. One can pursue an M.Tech in Civil and Structural Engineering after BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Mathematics as core subjects. Independent entrance tests for this programme are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test. For PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech along with a good score in entrance tests held for PG programme held by the various state, central, and private universities. ",
    "Scope": [
      "Structural engineers primarily deal with the design of structures and calculate the loads and stresses of the structure to be built. ",
      "They also test the quality and strength delivered by a range of building materials and understand how to incorporate support beams, columns, and foundations.",
      "Before work can begin, structural engineers are involved in the investigation and survey of build sites to determine the suitability of the earth for the requirements of the upcoming project. ",
      "They also coordinate and consult with other members of their projects, including engineers, environmental scientists, and architects. "
    ]
  },
  {
    "courseName": " Mining Engineering",
    "Branch": " Mining",
    "SimilarCourses": " Mining Machinery Engineering | Mineral Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Mining%20Engineering.jpg?itok=PiHC0pOv",
    "CourseDef": " Mining engineering is offered as a specialised branch in engineering that emphasises on the interdisciplinary aspects of both science and engineering including mine-surveying, mining mechanisation and industrial minerals. The course also deals with research in areas like of mine fire and explosions, ventilation, rock mechanics, underground and surface environment, geomatics and mine safety. The course is offered at undergraduate and postgraduate levels in leading technical institutes.",
    "Eligibility": "For UG: Candidates should have passed 10+2 board examination or equivalent with Physics, Chemistry and Mathematics as core subjects.For PG: Candidates should have a B.Tech degree in Mining Engineering with minimum qualifying marks.",
    "Scope": [
      "The course is designed to encourage students to pursue cross traditional modules of mining engineering and seek employable opportunities.",
      "With a specialised technical degree, you can get job offers from core mining or allied organisations.",
      "Pursuing mining engineering gives you an opportunity to work in exploration and research field."
    ]
  },
  {
    "courseName": " Electronics and Electrical Communication",
    "Branch": " Electronics",
    "SimilarCourses": " Power Electronics | Electronics Product Design Technology | Electronics and Power Engineering | Electronics and Media Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/2013/11/20/19-Electronics%20and%20Electrical%20Communication_0.jpg?itok=DD9BrUtx",
    "CourseDef": " Electronics and electrical engineering degree programs emphasis on wireless, digital, data and fiber optic communications. A BE/B.Tech degree prepares students for careers as systems engineers, research engineers, controls engineers, communication engineers and electronic engineer. They can also become researchers or take up teaching as a profession. A BE/B.Tech degree in Electronics and Electrical Communication is a 4-year program.\nThe discipline deals with electronic devices and software interfaces. It finds application in many industries like Energy, Agriculture, Telecommunication, Media and various other fields. Electronics and Electrical Engineers direct, control and test production processes and ensure safety, installation, and correct functioning of various communication mechanisms. One can go for an M.Tech in Electronics and Electrical Communication after successful completion of BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry and Mathematics as core subjects. Independent entrance tests are also held by various state,  central, and private universities which mostly require 50% as the prerequisite to appear for the testFor PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Electronics and Communication Engineering/ Electrical Engineering along with a good score in entrance tests held for PG programme held by the various state, central, and private universities.",
    "Scope": [
      "Graduates/postgraduates can work in the consumer electronics, aviation and avionics, manufacturing, electricity generation and distribution, communications, transportation, telecommunications industry as electronics engineers.",
      "They also work on improving the functionality and technology of communication devices and servers.",
      "Some of the profiles available for graduates and postgraduates are:"
    ]
  },
  {
    "courseName": " Biomedical Engineering",
    "Branch": " Life Sciences",
    "SimilarCourses": " Micro-Biology and Immunology Engineering | Genetic Engineering | Electronics and Biomedical Engineering | Bio Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Biomedical%20Engineering1.jpg?itok=PsinKdVz",
    "CourseDef": " Biomedical engineering program comprises study about tissue engineering, molecular or systems level biology/ physiology and mathematics. Students get to study about biomedical electronics, quantitative and analytical skills required to interpret data acquired and processing of medical data including imaging and enhancement techniques. Other aspects of the program include the study of biomechanics, cellular engineering, genetic engineering, orthopedic surgery, bio-instrumentation, medical imaging and bio-materials. Other important topics, about which the student will get to know include, about studying about advanced therapeutic and surgical devices, computer modeling of physiologic systems.",
    "Eligibility": "UG: Students planning to pursue biomedical engineering in the In order to pursue Bachelor of Engineering and Bachelor of Biotechnology in biomedical engineering, students need to have passed the higher secondary school certificate (10+2) examination with science subjects such as biology, maths, and chemistry.PG: Those planning to pursue their masters in biomedical engineering need to have pursued their bachelor of engineering or bachelor of technology or equivalent in Biomedical or Medical Electronics or Electrical and Electronics or Electronics and Communication or Electronics and Telecommunication or Instrumentation Engineering.",
    "Scope": []
  },
  {
    "courseName": " Agricultural and Irrigation Engineering",
    "Branch": " Agricultural",
    "SimilarCourses": " Agricultural and Food Engineering | Agricultural Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Agriculture%20and%20Irrigation%20Engineering.JPG?itok=RGTlAlaC",
    "CourseDef": " Agriculture and water are supposed to go hand in hand. Today, agriculture and irrigation engineering has come to acquire importance owing to the changes that are taking place due to global warming. The programme offers an opportunity to students to learn how to design and supervise the construction of agricultural buildings and storage facilities. Budding engineers would learn about the designing of livestock structures, greenhouses, silos, and cold-storage facilities for the crops. They would also know how to design and evaluate equipment that would be used for preparation of the ground for seeding, spraying and harvesting. Under the programme, they would also get to learn management and entrepreneurial skills.",
    "Eligibility": "Students from both the biology and maths stream are eligible to pursue B.E Agricultural and Irrigation Engineering course after successfully completing the 10+2 in science stream from a recognised college or university. The minimum marks secured in Physics, Chemistry and Mathematics or Biology stream may vary and certain institutes take into account the marks that were scored in the entrance examination by the candidates",
    "Scope": []
  },
  {
    "courseName": " Software Engineering",
    "Branch": " Computer Science",
    "SimilarCourses": " Mathematics and Computing Engineering | Information and Communication Technology | Information Science Engineering | Information Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Software-Engineer3.jpg?itok=g7UsIxWz",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Electronics and Media Technology",
    "Branch": " Electronics",
    "SimilarCourses": " Power Electronics | Electronics Product Design Technology | Electronics and Power Engineering | Electronics Control Systems Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/2013/11/20/6-Electronics%20and%20Media%20Technology_0.jpg?itok=nsEdaDV4",
    "CourseDef": " A BE/B.Tech degree in Electronics and Media Technology trains students in the field of broadcasting and data communication. Budding engineers acquire knowledge about the functions and principles of audio and multimedia systems. A BE/B.Tech degree is a four-year program in this discipline. The course curriculum includes programming, video, and radio production as well as advanced photography. Students get to learn about digital compositing, arts, and graphics. Film editing and news production are other areas about which students are taught in this program. One can pursue M.Tech in Electronics and Media Technology after successful completion of BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, and Mathematics as core subjects. Independent entrance tests are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Electronics and Communication Engineering/Electrical Engineering along with a good score in entrance tests held for PG program held by the various state, central, and private universities.",
    "Scope": [
      "As Media Planning Managers, the graduates and postgraduates prepare media schedules and research for various media opportunities. ",
      "The person is responsible for creating press or media communication campaigns as Media Relations Manager.",
      "As Electronic Design Engineer, they are responsible for making hardware and software designs.",
      "As technical head, they have to design and develop CMOS analog sub-systems."
    ]
  },
  {
    "courseName": " Dairy Technology",
    "Branch": " Food",
    "SimilarCourses": " Food Processing and Technology | Food and Biochemical Engineering | Food Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Dairy-Technology.jpg?itok=7DQr_fYd",
    "CourseDef": " Dairy Technology is a course which focuses on dairy products and is a part of the food technology and processing industry. Students pursuing dairy technology learn about milk processing as well the manufacturing process for its by-products. The study includes quality control at the time of processing of products. Students involve in gaining technical knowledge about dairy processing equipment. This includes analysis by students on production units like dairy plants and ice cream units. The course focuses on pasteurisation an important aspect of dairy technology.",
    "Eligibility": "UG Programme - Candidates must be Class XII pass out from a recognised school.PG Programme - Candidates applying for PG course must have completed B.Tech in Dairy Technology.",
    "Scope": [
      "There are many start-ups working in dairy farming which has increased scope for students pursuing courses in dairy technology.",
      "There are many Europe-based MNCs that performs research on various dairy products for which recruitment of scientists and engineers are conducted across the world."
    ]
  },
  {
    "courseName": " Fashion Technology",
    "Branch": " Fashion",
    "SimilarCourses": " Fashion and Apparel Engineering | Fashion Design",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/2013/11/20/4-Fashion%20Technology_0.jpg?itok=OzHlT7Yo",
    "CourseDef": " Fashion technology includes the application of aesthetics to accessories and clothing. In the fashion technology program, students are taught about design production management, fashion merchandising, colour mixing as well as marketing. Today, one of the most important aspects of any business is the marketing of products as it gives a boost to sales. Owing to the swift developments that are taking place in the textile and clothing industry, students acquire knowledge about apparel production, planning, and control. Students are trained how to use the latest machinery that is required in the fashion industry. Their entrepreneur skills are also harnessed so that they could also set up their own business.",
    "Eligibility": "UG Course: Candidates planning to pursue in bachelor's course in fashion technology need to have passed their 10+2 examination from a recognized board in Science stream with Physics, Chemistry, and Mathematics.PG Course: Candidates aspiring to take masters program need to have passed their bachelor's in fashion technology or bachelor of engineering or technology from any recognized institute or university.",
    "Scope": []
  },
  {
    "courseName": " Metallurgical Engineering",
    "Branch": " Metallurgy",
    "SimilarCourses": " Metallurgical and Materials Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Metallurgical%20Engineering1.jpg?itok=9IkTPVKa",
    "CourseDef": " The metallurgical engineering program is designed with an aim to prepare students to meet the growing needs of the Indian industry in the field of metallurgical and materials engineering. Students acquire knowledge about developing high-quality metal products throughout the various stages of the manufacturing process as well as how to test and inspect the final product. They are trained in the areas like extraction, physical and mineral processing. They get to know how to transform natural mineral resources into useful products for the society and also learn about pyrometallurgy, hydrometallurgy. As part of mineral processing, students are taught how to manage and control processes for separating, liberating the valuable minerals from ores.",
    "Eligibility": "UG Course: The candidates must have cleared 10+2 examination from a recognized board with Biology, Maths, Physics, and Chemistry.PG Course: Candidates planning to pursue their Master's in Metallurgical Engineering need to have done their Bachelor's in Engineering or Bachelor's of Technology in Metallurgical Engineering or equivalent degree.",
    "Scope": []
  },
  {
    "courseName": " Biotechnology and Biochemical Engineering",
    "Branch": " Life Sciences",
    "SimilarCourses": " Micro-Biology and Immunology Engineering | Genetic Engineering | Electronics and Biomedical Engineering | Bio Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Biotechnology%20and%20Biochemical%20Engineering.jpg?itok=_UqRW51R",
    "CourseDef": " Biotechnology and Biochemical Engineering focuses on biological sciences, chemical and biochemical engineering, microbiology, chemistry, biochemistry and genetics. Under this programme, students study about genetic technology, and learn how to develop treatments for different diseases. The programme also covers applied enzymology and enzyme technology; metabolic and reaction engineering for biocatalysis and renewable resource utilisation; and glycobiotechnology. While pursuing the course, students are taught as to how the cells, organs and tissues function. Engineers are trained to transform cellular and molecular advances into technologies with an aim to improve the quality of life.",
    "Eligibility": "UG: The candidate must have cleared his 10+2 from science stream with physics, chemistry, maths and biology in order to get enrolled for the bachelor’s program.PG: Those planning to pursue their masters in Biotechnology and Biochemical Engineering should have completed their Bachelor of Science or Bachelor of Technology in Biomedical, Chemical, Computer Science, Electrical, Electronics, Telecommunications, Instrumentation, Mechanical Engineering, Engineering Physics, Metallurgy and Materials Science.",
    "Scope": []
  },
  {
    "courseName": " Mechanical and Automation Engineering",
    "Branch": " Mechanical",
    "SimilarCourses": " Mechanical and Industrial Engineering | Mechanical Production Engineering | Mechanical Automobile | Tool Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Mechanical%20and%20Automation%20Engineering1.jpg?itok=w3QTi75F",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Mechanical and Industrial Engineering",
    "Branch": " Mechanical",
    "SimilarCourses": " Mechanical and Automation Engineering | Mechanical Production Engineering | Mechanical Automobile | Tool Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Mechanical%20and%20Industrial%20Engineering1.jpg?itok=KXcHz_J7",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Energy Management",
    "Branch": " Energy and Environment",
    "SimilarCourses": " Environment Management | Sustainable Development",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Energy%20Management.jpg?itok=gUAaXUlX",
    "CourseDef": " Energy management involves the study of the production of energy through natural resources, such as the extraction of oil and gas, as well as from renewable or sustainable sources of energy, including biofuels, hydro, wind, and solar power. BE/B.Tech in Energy Management is a 4-year program.Energy engineers are also taught how to find efficient, clean and innovative ways to supply energy. They work in a variety of roles including designing and testing machinery; developing ways of improving existing processes; converting, transmitting and supplying useful energy to meet our needs for electricity. One can pursue M.Tech in Energy Management after successful completion of BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, and Mathematics as core subjects. Independent entrance tests are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Energy Management along with a good score in entrance tests held for PG program held by the various state, central, and private universities.",
    "Scope": [
      "Graduates/postgraduates can consider a number of options in the energy sector, including oil and gas, renewable energy, power transmission and distribution firms.",
      "An energy manager is responsible for the energy policy of his/her firm. As a professional, he/she is required to formulate a plan for the optimal utilisation of energy within the firm.",
      "An energy auditor is required to conduct a detailed energy audit of firms and identify any wastage of energy while suggesting financially viable means for possible energy savings.",
      "Other key responsibilities include identifying and prioritising energy-saving measures after analysing their technical and financial feasibility of the firm. "
    ]
  },
  {
    "courseName": " Agricultural Engineering",
    "Branch": " Agricultural",
    "SimilarCourses": " Agricultural and Irrigation Engineering | Agricultural and Food Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Agricultural%20engineering.jpg?itok=2SibXXsV",
    "CourseDef": " Agricultural Engineering relates to the science and technology of producing food grains. It applies principles of engineering science and technology to production and processing in the field of agriculture. Here the knowledge of agriculture principles gets combined with the disciplines of animal biology, plant biology and also principles of Mechanical, Civil, Electrical and Chemical Engineering. BE/B.Tech in Agricultural Engineering is a 4-year programme.In this programme, the students basically study design of agricultural machinery and equipment; agricultural structures, agricultural resource management, surveying and land profiling. Subjects like climatology and atmospheric science; soil management and conservation including erosion and erosion control, seeding, tillage etc., are part of Agricultural Engineering. Harvesting and processing of crops, livestock production, and waste management are some of the areas of study in this programme. You can pursue M.Tech in Agricultural Engineering after successful completion of BE/B.Tech.",
    "Eligibility": "UG: You should have passed 10+2 in science stream (Physics, Chemistry, Mathematics) from a recognised board.Independent entrance tests for Agricultural Engineering are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.PG: A Bachelor's degree (B.E or B. Tech) in Agricultural Engineering along with a good score in entrance tests held for PG programme held by the various state, central, and private universities are required.",
    "Scope": [
      "Jobs in tractor-manufactures, irrigation companies, fertiliser and seed companies, and dairy firms.",
      "State agriculture departments recruit Agriculture Engineers at district and sub-district levels for processing, farm mechanisation etc.",
      "Postgraduates can appear for Agricultural Research Service Exam conducted by Agricultural Scientists Recruitment Board to become scientists.",
      "After qualifying NET one can pursue teaching at colleges and universities as a lecturer."
    ]
  },
  {
    "courseName": " Textile Engineering",
    "Branch": " Textile",
    "SimilarCourses": " Carpet and Textile Technology | Man Made Fiber Technology | Textile Production | Jute and Fiber Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/2013/11/20/2-Textile%20Engineering_0.jpg?itok=Ux0Ml8ii",
    "CourseDef": " Textile technology course is a discipline within engineering. The engineering course focuses on the development and characterisation of the polymeric raw materials and methods of conversion of the same into textile materials followed by further value addition and appropriate engineering into niche products. The course curriculum of textile technology emphasises on design, product and process development activities. Students also undergo practical training in an industrial establishment as part of their overall engineering education. Textile technology is offered at undergraduate and postgraduate levels.",
    "Eligibility": "UG programme – The candidate should have passed 10+2 examination from CBSE or any other equivalent examination board with Physics, Chemistry and Mathematics as core subjects. The candidates should also fulfil minimum qualifying marks in aggregate of the subjects. PG programme –The candidate should have a B.Tech degree with a minimum passing percentage in the aggregate of the subjects studied at the degree level.",
    "Scope": [
      "The present generation is talking about fashion and so will the future generations. Fashion has always been considered a personality trait and has been of great importance. Students pursuing fashion technology course reap the seeds of bringing new style statement in this world.",
      "There is a growing need for better materials and production processes in the mechanised sector too, which necessitates better materials which can be used as fire-resistant uniforms, for instance, or absorbent fabric for medical use, or weather resistant packaging materials. These challenges make textile technology an exciting field, besides the fashion stereotype."
    ]
  },
  {
    "courseName": " Electrical and Instrumentation Engineering",
    "Branch": " Electrical",
    "SimilarCourses": " Electrical and Communications Engineering | Power Engineering | Electrical Engineering | Electrical and Electronics Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Electrical%20and%20Instrumentation%20Engineering2.jpg?itok=DBQNbnTn",
    "CourseDef": " The discipline of Electrical and Instrumentation Engineering deals with the design of devices to measure physical quantities such as pressure, flow and temperature. It basically focuses on the study and application of electricity, electronics, and electromagnetism. Instrumentation engineering is a specialisation on the principle and operation of measuring instruments used in design and configuration of automated systems in electrical, pneumatic domains etc. BE/B.Tech in Electricity and Instrumentation Engineering is a 4-year programme.\nIndustries with automated processes, such as chemical or manufacturing plants require Electricity and Instrumentation Engineering graduates for improving system productivity, reliability, safety, optimisation, and stability. The design of such instrumentation requires a good understanding of physics that often extends beyond electromagnetic theory. Instrumentation is often dealt as the sensors of larger electrical systems. One can pursue M.Tech in Electricity and Instrumentation Engineering after successful completion of BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Mathematics as core subjects. Independent entrance tests for this programme are also held by various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/ B. Tech in Electrical Engineering along with a good score in entrance tests held for PG programme held by various state, central, and private universities.",
    "Scope": [
      "Graduates/postgraduates can work as Production Managers and can manage design engineers, purchase division and others involved in the production process.",
      "Electricity and Instrumentation Engineers also design and develop control systems.",
      "They also look after project management in terms of cost and time as well as optimisation of resources.",
      "They resolve problems with the existing machinery/ processes.",
      "They can also work as a Health and Safety Officer with a manufacturing unit to ensure compliance.",
      "As quality officers, they ensure quality standards of electronics."
    ]
  },
  {
    "courseName": " Genetic Engineering",
    "Branch": " Life Sciences",
    "SimilarCourses": " Micro-Biology and Immunology Engineering | Electronics and Biomedical Engineering | Bio Engineering | Biochemical Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Genetic%20Engineering1.jpg?itok=JGhoknQq",
    "CourseDef": " Genetic Engineering, or genetic modification, is the process of manipulating an organism’s genome using biotechnology. The process involves inserting a new DNA into the host genome. This is done by first isolating and copying the genetic material of interest using molecular cloning methods to generate a DNA sequence. Another way is to synthesize the DNA, and then insert it into the host organism. BE or B.Tech in Genetic Engineering is a four-year program.\nResearch, agriculture, industrial biotechnology, and medicine are some of the fields that use Genetic engineering techniques. Genetic Engineering studies the method in which traits and characteristics of an organism are transmitted through generations. Genetic Engineering graduates get the opportunity to work in medical and pharmaceutical industries, agriculture industries, research, and development to name a few. One can pursue M.Tech in Genetic Engineering after successful completion of BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Biology as core subjects. Independent entrance tests for this programme are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Genetic Engineering/ Biochemical Engineering along with a good score in entrance tests held for PG programme held by the various state, central, and private universities.",
    "Scope": [
      "PhD. graduates in genetic engineering usually carry on with their post-doctoral training and can join the university as lecturers or research scientists.",
      "Students with just an undergraduate or master's degree can only work as research assistants or at best as lab managers.",
      "Genetic Engineering scientists and researchers usually find jobs in the research labs of universities and research institutions. Some even join the R&D section of biotech industries.",
      "After completing Genetic Engineering program, one can work in the field of medical, pharmaceutical, agriculture, government and private organisations for research and development. "
    ]
  },
  {
    "courseName": " Safety and Occupational Health Engineering",
    "Branch": " Others",
    "SimilarCourses": " Systems Science Engineering | Plastic Engineering | Water Management | Rubber Technology",
    "ImgURL": "https://images.careers360.mobi/sites/all/themes/careers360_new/images/careers360-dumy.png",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Food Technology",
    "Branch": " Food",
    "SimilarCourses": " Food Processing and Technology | Food and Biochemical Engineering | Dairy Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Food%20Technology.jpg?itok=zvuT_WEA",
    "CourseDef": " Food Technology involves a blend of physical, chemical or microbiological processes and techniques for transforming raw ingredients into food and also other forms in food processing industry. Food processing refers to converting the raw ingredients into edible components or transforming food into other edible forms. BE/B.Tech in Food Technology is a 4-year program.\nFood Technology deals with the various chemical processes that food products undergo to make them consumable and ready to market. Food processors typically take clean, harvested crops or butchered animal products and use them to produce attractive, marketable food products with long shelf-life. Similar processes apply to animal feed. You can pursue M.Tech in Food Technology after successful completion of BE/B.Tech.",
    "Eligibility": "UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Biology as core subjects. Independent entrance tests for this program are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test. PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Food Technology/Food and Processing Technology along with a good score in entrance tests held for PG program held by the various state, central, and private universities. ",
    "Scope": [
      "As organic chemists, food technologist advises on the methods by which the raw materials have to be converted into processed food.",
      "As biochemists, they suggest improvements in flavor, texture, storage, and quality.",
      "As home economists, they become the expert in dietetics and nutrition and they test the food and recipes according to the directions on the containers.",
      "As engineers, they are required for planning, designing, improving and maintaining the processing systems.",
      "As research scientists, they carry out experiments regarding improvement in yield, flavor, nutritive value and general acceptability of the packaged food.",
      "As managers and accountants, they manage administration and the finances apart from supervising the processing work."
    ]
  },
  {
    "courseName": " Biological Sciences and Bioengineering",
    "Branch": " Life Sciences",
    "SimilarCourses": " Micro-Biology and Immunology Engineering | Genetic Engineering | Electronics and Biomedical Engineering | Bio Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Biological-Sciences-and-Bioengineering1.jpg?itok=5s5xDA07",
    "CourseDef": " Biological Sciences and Bioengineering program (BIO) aims to educate students about developing new bioinformatics tools. They also learn about Biomaterials, Biomechanics and Cell and Tissue Engineering, Biomedical Devices, Computational Bioengineering, Biomedical Imaging, Premed and Synthetic Biology. Students acquire knowledge about applying engineering principles to the re-conceptualisation of biological phenomena. Training is imparted to them to develop new materials and processes, which would include genetic modification of agriculturally important plants and human cells. The students would be given intensive knowledge about molecular biology.",
    "Eligibility": "In order to be eligible to apply for the bachelor course in Biological Sciences and Bioengineering, candidates must have Physics, biology, chemistry, mathematics in 10+2 and should have passed from a recognized board.Those wanting to pursue Master's in Biological Sciences and Bioengineering need to have Biomedical, Chemical, Computer Science, Electrical, Electronics, Telecommunications, Instrumentation, Mechanical Engineering, Engineering Physics, Metallurgy and Materials Science in the graduation.",
    "Scope": []
  },
  {
    "courseName": " Environmental Engineering",
    "Branch": " Others",
    "SimilarCourses": " Systems Science Engineering | Plastic Engineering | Water Management | Rubber Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Environment.jpg?itok=pCEz6RSM",
    "CourseDef": " Traditionally, environmental engineering was a branch of civil engineering and was variously called sanitary engineering and public health engineering. However, with the coming of dedicated higher education options in the environment during the 1980s, it found its own niche. BE/B.Tech in Environmental Engineering is a 4-year program.\nEnvironmental engineering is a multidisciplinary subject that borrows ideas from a number of different sciences as well as fields of engineering to understand environmental issues and engineer design solutions for these, for example, by creating a landfill or a waste water plant. Typically, a program in this discipline will include concepts from physics, chemistry, and biology as well as civil, mechanical, electrical and chemical engineering. Apart from this, students will also learn about impact assessment, environmental management, and audit. However, most modules will be geared towards developing a comprehensive understanding of different forms of pollution, managing environmental resources and controlling waste. One can pursue M.Tech in Environmental Engineering after successful completion of BE/B.Tech.",
    "Eligibility": "UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, and Mathematics as core subjects. Independent entrance tests are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Environmental Engineering along with a good score in entrance tests held for PG program held by the various state, central, and private universities. ",
    "Scope": [
      "Job prospects for environmental engineers in various segments, including research centers, NGOs, and government departments are increasing day by day.",
      "Professionals who have M.Tech degree are in demand in various committees engaged in the study and analysis of environmental risks.",
      "The Central Pollution Control Board (CPCB) of India also recruits environmental engineering professionals for various posts through UPSC.",
      "Job profiles available for environmental engineers are as follows: "
    ]
  },
  {
    "courseName": " Construction Technology",
    "Branch": " Civil",
    "SimilarCourses": " Civil and Structural Engineering | Building and Construction Engineering | Civil Environmental Engineering | Construction Technology and Management",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Construction%20Technology.JPG?itok=1XN54wG2",
    "CourseDef": " Construction Technology is a branch of Civil Engineering. It involves the study of construction methods. Construction technologists design, plan, construct and manage infrastructures such as highways, bridges, airports, buildings, dams etc. Hence, the course will focus on different types of materials used for construction, along with testing procedures to assure quality control. Construction technology is a combination of civil engineering and construction management. BE/B.Tech degree in Construction Technology is a four-year program.Skills required to become a successful construction engineer include a good understanding of math and science and critical and analytical thinking, time management, people management and good communication skills. Construction Technology curriculum is a mixture of Engineering Mechanics, Engineering Design, Construction Management, General Science, and Mathematics. One can pursue M.Tech in Construction Technology after successful completion of BE/B.Tech",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Mathematics as core subjects. Independent entrance tests for this programme are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test. For PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Building and Construction Engineering/ Civil Engineering along with a good score in entrance tests held for PG programme held by the various state, central, and private universities.",
    "Scope": [
      "Construction technologists hold supervisory or administrative positions ranging from supervisor of a construction site to city engineer, public works director, and city manager",
      "Graduates and post-graduates work as structural engineers who design and assess major projects, such as construction of buildings, bridges, or dams, to ensure their strength and durability",
      "As transportation engineers, they plan, design, operate and maintain everyday systems, such as streets and highways",
      "Building and construction engineers are often hired as Division Head, Project Manager,Supervisory Engineer, Consultants, Director of Public Works, and Quality Analysts"
    ]
  },
  {
    "courseName": " Construction Technology and Management",
    "Branch": " Civil",
    "SimilarCourses": " Civil and Structural Engineering | Building and Construction Engineering | Civil Environmental Engineering | Construction Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Construction%20Technology%20and%20Manegement.jpg?itok=6T6a-B2z",
    "CourseDef": " Construction usually refers to the erection of large structures such as buildings, ship, aircraft, dams, roads, and bridges. By extension, Construction Technology Management refers to the planning, coordination and successful implementation of such structures. A branch of Civil Engineering, Construction Technology and Management is a fusion of civil engineering and construction management. B.Tech/BE degree in Construction Technology and Management is a 4-year program.B.Tech/BE degree in Construction Technology and Management gives the students an insight into scientific principles involved in construction, understanding about the behaviour of construction materials and the fundamentals of structural mechanics. Construction technologists should have good knowledge about different types of materials used for construction, along with testing procedures to assure quality control. The principles of drainage, water supply and distribution, heating and ventilation, and recycling of construction and demolition waste management. One can pursue an M.Tech degree in Construction Technology and Management after successful completion of B.Tech/BE.",
    "Eligibility": "UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Mathematics as core subjects. Independent entrance tests for this programme are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test. PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Building and Construction Engineering/Civil Engineering along with a good score in entrance tests held for PG programme held by the various state, central, and private universities.  ",
    "Scope": [
      "Graduates/postgraduates can work as construction planning engineer and a site engineer in any construction projects in arena of residential buildings, cooperatives, huge housing projects, commercial buildings, and hospitals",
      "They also estimate the overall project costs and conduct negotiations regarding the elimination of unnecessary scope and cost.",
      "As quality control managers, they enforce the quality control to reduce potential defects and poor workmanship.",
      "Construction managers also optimise and accelerate the design and construction schedule."
    ]
  },
  {
    "courseName": " Mechanics",
    "Branch": " Mechanical",
    "SimilarCourses": " Mechanical and Industrial Engineering | Mechanical and Automation Engineering | Mechanical Production Engineering | Mechanical Automobile",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Mechanics.JPG?itok=0Oarw-JB",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Tool Engineering",
    "Branch": " Mechanical",
    "SimilarCourses": " Mechanical and Industrial Engineering | Mechanical and Automation Engineering | Mechanical Production Engineering | Mechanical Automobile",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Tool%20Engineering2.jpg?itok=PzOv-DdM",
    "CourseDef": " Tool Engineering is a division of Industrial Engineering. Its function is to plan the process of manufacture, develop various tools and machines and integrate facilities required for producing particular products with minimal expenditure of time, labour and material. Coursework is designed to include the art of designing jigs, fixtures, press tools, creating die casting designs, plastic moulds designs, mastering advanced plastic processing technologies and becoming perfect in metrology and measurements. B.E./B.Tech in Tool Engineering is a 4-year programme.\nTool engineering is based on the use and application of various industrial tools within a manufacturing set-up. Students specialising in this branch of engineering pay attention to the\nstructure and stiffness of the various industrial tools and machines used for creating certain products. One can pursue M.E./M.Tech in Tool Engineering after successful completion of BE/B.Tech.",
    "Eligibility": "UGCandidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry and Mathematics as core subjects. Independent entrance tests for this programme are also held by various state, central and private universities which mostly require 50% as the prerequisite to appear for the test.PGCandidates must hold a degree in Bachelor of Engineering/B.Tech along with a good score in entrance tests held for PG programme conducted by various state, central and private universities.",
    "Scope": []
  },
  {
    "courseName": " Mathematics and Computing Engineering",
    "Branch": " Computer Science",
    "SimilarCourses": " Software Engineering | Information and Communication Technology | Information Science Engineering | Information Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Mathematics%20and%20Computing%20Engineering.jpg?itok=UhT-jEIL",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Mechanical Automobile",
    "Branch": " Mechanical",
    "SimilarCourses": " Mechanical and Industrial Engineering | Mechanical and Automation Engineering | Mechanical Production Engineering | Tool Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Mechanical%20Automobile1.jpg?itok=by586D2V",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Chemical and Polymer Engineering",
    "Branch": " Chemical",
    "SimilarCourses": " Petrochemical Engineering | Chemical Ceramic Technology | Chemical Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Chemical%20and%20Polymer%20Engineering1.jpg?itok=ZGBqZUWS",
    "CourseDef": " The job of a Chemical and Polymer Engineer relates to converting natural and synthetic raw materials into a host of products that include plastic, rubber, textile fabric and advanced materials. An undergraduate course in Chemical and Polymer Engineering imbibes innovative ideas in students on the application of polymer materials and developing polymer processing. B.Tech or BE in Chemical and Polymer Engineering is a 4-year program.\nChemical and Polymer Engineering is the amalgamation of chemical engineering with polymer science. Polymer science or macromolecular science is a subfield of Materials Science concerned with polymers. The students are trained in various Computer Aided Engineering (CAE) software such as Accelrys, Material Studio for molecular simulation etc. One can pursue M.Tech in Chemical and Polymer Engineering after successful completion of B.Tech or BE program.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Mathematics as core subjects. Independent entrance tests for this programme are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Polymer Engineering/Plastic Technology along with a good score in entrance tests held for PG programme held by the various state, central, and private universities. Candidates with an MSc degree in chemistry or physics are also eligible for the M. Tech programme in Polymer Engineering.",
    "Scope": [
      "Graduates and postgraduates can be employed as production supervisors, quality control inspectors, mold designers, and production planners in several private and public sector companies.",
      "They can even work as technologists or polymer scientists in the Ministry of Petroleum and Natural Gas, Oil and Natural Gas Commission (ONGC), Oil laboratories, and petrochemicals engineering plants.",
      "Polymer engineers can also opt for teaching jobs and work as lecturers or professors in engineering institutes.",
      "Research and development, processing, quality control, design and manufacture of molds, training, management and related activities are some other areas where they can find jobs."
    ]
  },
  {
    "courseName": " Industrial and Production Engineering",
    "Branch": " Production",
    "SimilarCourses": " Production Engineering and Management | Industrial Engineering | Industrial Design | Production Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Industrial%20and%20Production%20Engineering1.jpg?itok=TBv3y3tL",
    "CourseDef": " Production Engineering is a specialised area of Mechanical Engineering. The objective of the discipline is to enable engineers to improve efficiency and effectiveness of manufacturing and service sector Industries. The curriculum includes basic mechanical engineering subjects. Some of them are engineering mechanics, the strength of materials, machine design, thermodynamics, heat transfer etc. The course makes graduates compatible with the existing and emerging needs of the industry. B.E or B.Tech in Industrial and Production. Engineering is a four-year programme.\nThose who have done B.E or B.Tech in Industrial and Production Engineering would understand existing technological trends and help to add new technology to the existing system. Most leading manufacturing houses look out for engineers who specialise in Industrial Production so as to reduce cost, increase efficiency and make their products marketable in the competitive era. One can pursue M.Tech in Industrial and Production Engineering after successful completion of BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Mathematics as core subjects. Independent entrance tests for this programme are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Mechanical Engineering along with a good score in entrance tests held for PG programme held by the various state, central, and private universities.",
    "Scope": [
      "Industrial and production engineers use principles of engineering, mass production and technology to help companies find ways to offer services or create a product efficiently.",
      "Industrial engineers work to improve the product through better management and quality control."
    ]
  },
  {
    "courseName": " Instrumentation Engineering",
    "Branch": " Instrumentation",
    "SimilarCourses": " Instrumentation Technology | Instrumentation and Control Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Instrumentation-Engineering1.jpg?itok=vbrH7rEC",
    "CourseDef": " Instrumentation engineers have acquired importance as their scope of work has penetrated into other spheres such as electrical, electronics, chemical, and computers. Owing to technological advancements that are taking place in a wide array of fields, including medical industry, students are taught about biomedical instrumentation. With stress being laid on increasing digitization in the country, students acquire knowledge about digital signal processing. Students are also trained in electrical systems, circuits, and network as now the country is heading towards smart metering and net metering.",
    "Eligibility": "UG Course: Students who are planning to take up bachelor's in instrumentation and control engineering need to have passed their 10+2 examination in science stream with physics, chemistry, mathematics and biology.PG Course: Candidates need to clear their bachelor's in electronics and instrumentation engineering, electronics and communication engineering, electronics engineering.",
    "Scope": []
  },
  {
    "courseName": " Water Management",
    "Branch": " Others",
    "SimilarCourses": " Systems Science Engineering | Plastic Engineering | Rubber Technology | Silk Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Water%20Management.JPG?itok=AJiXJoIr",
    "CourseDef": " Water Management is a discipline of civil engineering. It is taught as a course at the undergraduate level and as a speciality at the postgraduate level across engineering colleges in India. Coursework introduces students to the methods and techniques applied in the study of water needs for agriculture, industry, households, recreation, navigation and hydroelectric power generation. The coursework also deals with problems related to stormwater drainage and flood damage mitigation and how to solve problems related to water quality in erosion, sedimentation, protection of ecosystems and other natural resources. B.E./B.Tech in Civil Engineering is a 4-year programme.\nBudding engineers are introduced to the various ways of planning, developing, distributing and managing the optimum use of water resources. They are introduced to methods for optimising the use of water and in minimising the environmental impact of water use on the natural environment. One can pursue M.E./M.Tech in Water Resources Engineering after successful completion of BE/B.Tech.",
    "Eligibility": "UGCandidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry and Mathematics as core subjects. Independent entrance tests for this programme (B.E.Civil Engineering) are also held by various state, central and private universities which mostly require 50% as the prerequisite to appear for the test.For PGCandidates must hold a degree in Bachelor of Engineering/B.Tech along with a good score in entrance tests held for PG programme (M.E. Water Resources Engineering) conducted by various state, central and private universities.",
    "Scope": [
      "Engineers having studied Water Resource Management have employment opportunities awaiting them in local municipalities and governing bodies where they get to brainstorm solutions to address future water demands for cities and coastal flood control projects.",
      "There are employment opportunities for them in the manufacturing and distribution industry, water conservation industry and engineering consulting industry."
    ]
  },
  {
    "courseName": " Ceramic Engineering",
    "Branch": " Ceramic",
    "SimilarCourses": " Ceramics and Cement Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Ceramic-Engineering1.jpg?itok=cHrzFVtf",
    "CourseDef": " Ceramic engineering program deals primarily with manufacturing and design of ceramics. This includes designing of nanostructured ceramics. The program also prepares students about the manufacturing aspect of ceramic design and its properties. In properties, one learns about thermal properties as well as about elasticity, hardness, fracture toughness and creep as well as strength. While dealing with manufacturing , the students learn about casting, sintering, extrusion and injection. As far as designing is concerned, students will also get to know about various principles of design with brittle materials, analysis of fracture, Weibull statistics, and hardening of ceramics.",
    "Eligibility": "Students seeking admission to a Bachelor’s program in Ceramic Engineering must have passed the higher secondary school certificate (10+2) examination with, physics, biology, maths, and chemistry.Those who are planning to pursue Masters in Ceramic Engineering, need to have completed their Bachelor of Engineering or Bachelor of Technology in Ceramic Engineering, Metallurgical, Aeronautical, Mechatronics, Marine, Industrial or Manufacturing.",
    "Scope": []
  },
  {
    "courseName": " Mechanical Production Engineering",
    "Branch": " Mechanical",
    "SimilarCourses": " Mechanical and Industrial Engineering | Mechanical and Automation Engineering | Mechanical Automobile | Tool Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Mechanical%20Production%20Engineering2.jpg?itok=OOZSnkfb",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Civil Environmental Engineering",
    "Branch": " Civil",
    "SimilarCourses": " Civil and Structural Engineering | Building and Construction Engineering | Construction Technology | Construction Technology and Management",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Civil%20%20Environmental%20Engineering.jpg?itok=zPem9A22",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Electronics Engineering - Design and Manufacturing",
    "Branch": " Electronics",
    "SimilarCourses": " Power Electronics | Electronics Product Design Technology | Electronics and Power Engineering | Electronics and Media Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/2013/11/20/18-Electronics%20Engineering%20-%20Design%20and%20Manufacturing_0.jpg?itok=U4QYe9Rs",
    "CourseDef": " An undergraduate degree in Electronics Engineering - Design and Manufacturing deals with the design and testing of circuits that use resistors, capacitors, inductors, diodes, and transistors. Using Electronic Design Automation students are taught to design integrated circuits. Learning to construct circuit schematics and layouts are part of the program. BE/B.Tech in Electronics Engineering - Design and Manufacturing is a 4-year program.\nDesigning, testing, and the creation of analog and digital circuits and systems, power electronics and industrial drives and control and instrumentation systems are taught as part of the curriculum. One can pursue M.Tech in Electronics Engineering - Design and Manufacturing after successful completion of BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, and Mathematics as core subjects. Independent entrance tests are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Electronics and Communication Engineering/Electrical Engineering along with a good score in entrance tests held for PG program held by the various state, central, and private universities. ",
    "Scope": [
      "Graduates/postgraduates in Electronics Engineering - Design and Manufacturing are actively hired in entertainment sector, consumer electronics industry and also in manufacturing units of signalling equipment and radar control equipment.",
      "Government sector provides numerous job openings for M.E in Electronics Engineering - Design and Manufacturing. ",
      "They are also mostly engaged in hardware manufacturing firms and also in power companies abroad.",
      "Following are the job types that are available for graduates/post-graduates in this discipline:"
    ]
  },
  {
    "courseName": " Transportation Engineering",
    "Branch": " Others",
    "SimilarCourses": " Systems Science Engineering | Plastic Engineering | Water Management | Rubber Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Transportation%20Engineering1.jpg?itok=tyWoX2Wi",
    "CourseDef": " Transportation Engineering is a discipline of Civil Engineering taught at the undergraduate level and as a speciality at the postgraduate level across engineering colleges in India. It is the application of technology and scientific principles concerned with the planning, functional design, operation and management of facilities for any mode of transportation. This is expected to provide for the safe, efficient, rapid, comfortable and convenient movement of people and goods.Coursework enables students to learn about urban planning and also includes factors such as technical forecasting and politics. B.E./B.Tech in Civil Engineering is a 4-year programme.\nBudding engineers are introduced to urban planning model, estimation of trip generation, trip distribution, mode choice and route assignment. Furthermore, they are introduced to sophisticated forecasting which includes aspects of traveller decisions, auto ownership, trip chaining and the choice of residential and business location. One can pursue M.E./M.Tech inTransportation Engineering after successful completion of BE/B.Tech.",
    "Eligibility": "UGCandidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry and Mathematics as core subjects. Independent entrance tests for this programme (B.E. Civil Engineering) are also held by various state, central and private universities which mostly require 50% as the prerequisite to appear for the test.For PGCandidates must hold a degree in Bachelor of Engineering/B.Tech along with a good score in entrance tests held for PG programme (M.E. Civil Engineering) conducted by various state, central and private universities.",
    "Scope": [
      "Engineers having specialised in Transportation Engineering are required by construction companies to prepare preliminary and final plans for highways, bridges, drainage structures, municipal utilities, roadway lighting, traffic control devices and intelligent transportation systems. ",
      "There are jobs for transportation engineers in various government departments, public and private transportation service providers and electrical &amp; transportation engineering consultancies."
    ]
  },
  {
    "courseName": " Biochemical Engineering",
    "Branch": " Life Sciences",
    "SimilarCourses": " Micro-Biology and Immunology Engineering | Genetic Engineering | Electronics and Biomedical Engineering | Bio Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Biochemical%20Engineering1.jpg?itok=ic9dqjfT",
    "CourseDef": " Biochemical Engineering is a branch of Chemical Engineering or Biological Engineering. It is a branch of engineering that deals with the design and construction of unit processes that involve biological organisms or molecules. It is similar in nature to Chemical Engineering or Biological Engineering. BE/B.Tech in Biochemical Engineering is a 4-year programme.\nThe interaction between chemical engineering, biochemistry and microbiology is the main focus of the course. The objective of this branch is to train students in biochemical engineering, biotechnology, microbial and enzyme systems. This will help them in understanding the biological or biochemical phenomena of these systems. Biochemical Engineering also deals with the kinetics of growth, death and metabolism, fermentation, agitation, mass transfer and enzyme technology. One can pursue M.Tech in Biochemical Engineering after successful completion of BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Mathematics and Biology as core subjects. Independent entrance tests for Biochemical Engineering are also held by various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/B. Tech in Biochemical Engineering along with a good score in entrance tests held for PG programme held by various state, central, and private universities.",
    "Scope": [
      "Food and beverage companies, agriculture and chemical industries, waste management firms, petroleum oil and gas fields, biomedical firms, engineering design companies, and pharmaceutical companies offer good prospects for biochemical engineers ",
      "Except laboratories, biochemical engineers can involve in the overall supervision of a plant, apart from providing technical and management services.",
      "Biochemical engineers also supervise the small and intermediate-scale manufacturing and packaging activities in pharmaceutical product development for clinical trial purposes.",
      "They also work closely with process chemists and control engineers to ensure the process plant is set up to provide maximum output levels",
      "Fresh biochemical engineering graduates and postgraduates can also work as:"
    ]
  },
  {
    "courseName": " Geo informatics",
    "Branch": " Geotechnical",
    "SimilarCourses": " Geotechnical Engineering | Geosciences and Remote Sensing",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Geo%20informatics.jpg?itok=jeoaIgPw",
    "CourseDef": " Geoinformatics deals with the study of earth and its allied informatics. It is the scientific technology dealing with the spatial information - the digital connection between location, people, and activities. This information can graphically illustrate what is happening (where, how and why) to show the insight and impact of the past, the present and the (likely) future. And it ends with a map that a common man can easily understand and interpret. BE/B.Tech in Geo-Informatics is a 4-year program.\nThe use of Geoinformatics helps to tackle the problems related to Geography, Geoscience and related branches of Engineering. There is much geospatial software like ArcGIS, ENVI, Micro Station and other opensource software like QGIS, GRASS, SAGA which helps in GIS analysis. You can pursue M.Tech in Geo-Informatics after successful completion of BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Biology as core subjects. Independent entrance tests for this programme are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Geo-Informatics/Geo-Information Technology along with a good score in entrance tests held for PG programme held by the various state, central, and private universities.",
    "Scope": [
      "Graduates/postgraduates are mostly hired by central government agencies such as the Department of Space - National Remote Sensing Agency (NRSA Hyderabad),  Regional Remote Sensing Application Centre (RRSAC Kharagpur, Dehradun, Jodhpur, Nagpur, and Bangalore), and Indian Space Research Organisation, (ISRO Bangalore).",
      "Professor, Reader, and Research positions are available in academic institutions and the prospects of starting one's own enterprise."
    ]
  },
  {
    "courseName": " Mechanical Engineering - Design and Manufacturing",
    "Branch": " Mechanical",
    "SimilarCourses": " Mechanical and Industrial Engineering | Mechanical and Automation Engineering | Mechanical Production Engineering | Mechanical Automobile",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/2013/11/20/5-Mechanical%20Engineering%20-%20Design%20and%20Manufacturing_0.jpg?itok=P1Qj2EV-",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Geotechnical Engineering",
    "Branch": " Geotechnical",
    "SimilarCourses": " Geosciences and Remote Sensing | Geo informatics",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Geotechnical%20Engineering2.jpg?itok=dWpnVY4r",
    "CourseDef": " The geotechnical engineer plays a key role in most civil engineering projects. Geotechnical engineers assess the properties and behaviour of soil and rock formations. It is a branch of civil engineering and deals with the engineering behaviour of subsurface or earth materials. BE/B.Tech in Geotechnical Engineering is a 4-year programme.\nThe Physico-chemical behaviour of soils, strength and deformation behaviour of soils, soil dynamics and earthquake engineering and machine foundations are some of the areas of study. One can pursue M.Tech in Geotechnical Engineering after successful completion of BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Mathematics as core subjects. Independent entrance tests for this programme are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Geo-Informatics/Geo-Information Technology along with a good score in entrance tests held for PG programme held by the various state, central, and private universities.",
    "Scope": [
      "There is a range of opportunities in the Civil Engineering profession for geotechnical specialists.Those who combine geotechnical knowledge with managerial skills needed in the construction industry is much in demand.",
      "With shrinking land space available for development, large and complex modern structures may have to be built on the weak ground. Geotechnical engineers plan and execute soil and ground investigations and laboratory testing, understand the results, and propose designs and construction to overcome the difficulties."
    ]
  },
  {
    "courseName": " Electronics Product Design Technology",
    "Branch": " Electronics",
    "SimilarCourses": " Power Electronics | Electronics and Power Engineering | Electronics and Media Technology | Electronics Control Systems Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Electronics-Product-Design-Technology2.jpg?itok=6O_KrnAR",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Leather Technology",
    "Branch": " Others",
    "SimilarCourses": " Systems Science Engineering | Plastic Engineering | Water Management | Rubber Technology",
    "ImgURL": "https://images.careers360.mobi/sites/all/themes/careers360_new/images/careers360-dumy.png",
    "CourseDef": " The Leather industry in India is gaining a great deal of importance owing to an annual turnover of US$ 12 billion. The industry is labor intensive as it employs more than 20.5 million people. Today, the program has acquired significance as the government is laying a lot of stress on the brand building of leather, innovation as well as stress on environmental issues. Keeping all these developments in mind and with the growth in the fashion industry, students are taught about Fashion Styling and Computer Added Design Of Leather Product. Owing to the growth of leather goods and accessories sector, students acquire knowledge about computer applications in leather technology as well as the theory of mechanism of inorganic tannages.",
    "Eligibility": "UG Course: Candidates aspiring to pursue Bachelor's of Technology or Bachelor's of Engineering in Leather Technology need to have passed 10+2 examination with physics, chemistry, and mathematics.PG Course: Students aspiring to take up Master's in Leather Technology need to have passed their graduation in either Leather Technology, Biotechnology, or Chemical Engineering.",
    "Scope": []
  },
  {
    "courseName": " Chemical Ceramic Technology",
    "Branch": " Chemical",
    "SimilarCourses": " Petrochemical Engineering | Chemical and Polymer Engineering | Chemical Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Chemical-ceramic-engg.jpg?itok=GcgGu-cJ",
    "CourseDef": " Chemical Ceramic Technology is a specialised branch of Chemical Engineering. It deals with the development and manufacturing of ceramic and the process of combining it with other chemicals to create ceramic and allied products. Ceramic Chemical Engineers work on the research of the materials, chemical processes, properties, manufacturing, design, and applications of ceramic materials BE/B.Tech in Chemical Ceramic Technology is a 4-year program.Chemical Ceramic Technology has applications in other branches of engineering such as Mechanical Engineering, Electrical Engineering, Chemical Engineering and Materials Engineering. Ceramic materials are used in industries such as mining, aerospace, medicine, refinery, food and chemical, packaging science, electronics, industrial and transmission electricity etc. One can pursue M.Tech in Chemical Ceramic Technology after successful completion of BE/B.Tech.",
    "Eligibility": "UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Mathematics as core subjects. Independent entrance tests for this program are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Polymer Engineering or allied subjects along with a good score in entrance tests held for PG program held by the various state, central, and private universities. Candidates with an MSc degree in Chemistry are also eligible for the M.Tech program in Chemical Ceramic Technology. ",
    "Scope": [
      "Research: In the research field, the main work of Ceramic technologists involves the study and application of chemical and thermal interactions of oxides, which make ceramics.",
      "Design: Ceramic engineers design the kilns and other equipment used in manufacturing as well as direct the crew that build the plants and operate the kilns.",
      "Production: In the glass industry, their work involves the manufacture of tableware, fibre optics, bulbs, windowpanes, and electronics ancillaries. Ceramic engineers in the electronics sector, manufacture integrated circuits, sensors etc.",
      "Testing: Ceramic engineers are responsible for testing the quality of raw materials and samples prepared for production in the testing laboratories."
    ]
  },
  {
    "courseName": " Power Engineering",
    "Branch": " Electrical",
    "SimilarCourses": " Electrical and Instrumentation Engineering | Electrical and Communications Engineering | Electrical Engineering | Electrical and Electronics Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Power%20Engineering1.jpg?itok=WaSzhgI1",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Power Electronics",
    "Branch": " Electronics",
    "SimilarCourses": " Electronics Product Design Technology | Electronics and Power Engineering | Electronics and Media Technology | Electronics Control Systems Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Power%20Electronics1.jpg?itok=0ooR0pt7",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Industrial Biotechnology",
    "Branch": " Life Sciences",
    "SimilarCourses": " Micro-Biology and Immunology Engineering | Genetic Engineering | Electronics and Biomedical Engineering | Bio Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Industrial%20Biotechnology.jpg?itok=z3tcdzqR",
    "CourseDef": " Industrial Biotechnology is a function of applied Biotechnology. The discipline studies the methods of using Biotechnology for producing and processing materials, bioenergy, chemicals and also pharmaceuticals products. Industrial Biotechnologists find alternatives to preserve natural resources through alternatives and sustainable form of development. BE or B.Tech in Industrial Biotechnology is a four-year program. By doing this programme, students learn to use micro-organisms and other enzymes for manufacturing products. Industrial bio-technologists come up with ideas for manufacturing products using less energy, reducing waste and still ensuring higher yields at reasonable pricing. One can pursue M.Tech in IndustrialBiotechnology after successful completion of BE/B.Tech.",
    "Eligibility": "For UGCandidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Biology as core subjects. Independent entrance tests for this programme are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG:Candidates must hold a degree in Bachelor of Engineering/B.Tech in Industrial Engineering/Genetic Engineering/Biotechnology along with a good score in entrance tests held for PG programme held by the various state, central, and private universities.",
    "Scope": [
      "Industrial biotechnology engineers can seek employment in chemical and textile industries, agricultural sectors, pharmaceutical firms and manufacturing industries.",
      "Students with just an undergraduate or master&#39;s degree can only work as research assistants or at best as lab managers.",
      "They usually find jobs in the research labs of universities and research institutions. Some even join the R&amp;D section of biotech industries."
    ]
  },
  {
    "courseName": " Ceramics and Cement Engineering",
    "Branch": " Ceramic",
    "SimilarCourses": " Ceramic Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Ceramic%20and%20Cement%20Engineering.jpg?itok=8hpqTJWs",
    "CourseDef": " Ceramics and Cement Engineering is the science of creating objects from inorganic and non-metallic objects using heat, lowering temperatures etc. Studies relating to purification of raw materials, production of chemical compounds and their formation into components and their structure, composition and properties are part of the programme. BE/B.Tech in Ceramics and Cement Engineering is a four-year program.\nThe curriculum includes courses like Materials Thermodynamics; Raw Materials Analysis; Ceramic Processing; Drawing of Refractory Lining and Joints; Ceramic Fabrication; Ceramic Equipment Design; Sensor Technology; Electrical and Magnetic Ceramics; and Pollution & Waste Management in Ceramic Industry. One can pursue an M.Tech in Ceramics and Cement Engineering after successful completion of BE/B.Tech.",
    "Eligibility": "For UG: Candidates must have passed 10+2 with minimum qualifying marks in aggregate with Physics, Chemistry, Mathematics as core subjects. Independent entrance tests for this programme are also held by the various state, central, and private universities which mostly require 50% as the prerequisite to appear for the test.For PG: Candidates must hold a degree in Bachelor of Engineering/B.Tech in Ceramic Engineering/Ceramic and Cement Engineering along with a good score in entrance tests held for PG programme held by the various state, central, and private universities.",
    "Scope": [
      "Graduates and postgraduates develop procedures for processing non-metallic inorganic materials into various ceramic products such as fibre optic products, glassware, coatings for space vehicles, and components of nuclear fuel",
      "They are also involved in research, product development, and production engineering of ceramic products that are in compliance with the required quality norms",
      "Specialised engineers develop advanced heat tiles for space shuttles and supersonic space planes",
      "They also help in developing such materials that enclose and support aircraft engines functioning at high temperatures.",
      "Jobs available for Ceramics and Cement Engineers include:"
    ]
  },
  {
    "courseName": " Information Science Engineering",
    "Branch": " Computer Science",
    "SimilarCourses": " Software Engineering | Mathematics and Computing Engineering | Information and Communication Technology | Information Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Information%20Science%20Engineering.jpg?itok=RdE5fJr5",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Marine Engineering",
    "Branch": " Marine",
    "SimilarCourses": " Naval Architecture and OceanEngineering | Naval Architecture and Marine Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Marine-Engineering1.jpg?itok=uwDPos3q",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Nano Technology Engineering",
    "Branch": " Nano Technology",
    "SimilarCourses": " Nano Technology and Robotics",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Nano%20Technology%20Engineering1.jpg?itok=C2QRh8Pv",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Bio-Medical and Instrumentation Engineering",
    "Branch": " Life Sciences",
    "SimilarCourses": " Micro-Biology and Immunology Engineering | Genetic Engineering | Electronics and Biomedical Engineering | Bio Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Biomedical-and-Instrumentation-Engineering1.jpg?itok=rIuYN7mv",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Bio Engineering",
    "Branch": " Life Sciences",
    "SimilarCourses": " Micro-Biology and Immunology Engineering | Genetic Engineering | Electronics and Biomedical Engineering | Biochemical Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Bioengineering1.jpg?itok=GTikvBpA",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Nano Technology and Robotics",
    "Branch": " Nano Technology",
    "SimilarCourses": " Nano Technology Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Nano%20Technology%20and%20Robotics1.jpg?itok=D5nl5Ja_",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Food Processing and Technology",
    "Branch": " Food",
    "SimilarCourses": " Food and Biochemical Engineering | Food Technology | Dairy Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Food%20Processing%20and%20Technology.jpg?itok=tzJbAuQj",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Metallurgical and Materials Engineering",
    "Branch": " Metallurgy",
    "SimilarCourses": " Metallurgical Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Metallurgical%20and%20Materials%20Engineering2.jpg?itok=gwOsv5j4",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Instrumentation and Control Engineering",
    "Branch": " Instrumentation",
    "SimilarCourses": " Instrumentation Technology | Instrumentation Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/2013/11/20/1-Instrumentation%20and%20Control%20Engineering_0.jpg?itok=NUEAPt7h",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Micro-Biology and Immunology Engineering",
    "Branch": " Life Sciences",
    "SimilarCourses": " Genetic Engineering | Electronics and Biomedical Engineering | Bio Engineering | Biochemical Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Micro%20Biology%20and%20Immunology%20Engineering1.jpg?itok=doRHbEb2",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Engineering Physics",
    "Branch": " General Science",
    "SimilarCourses": " Engineering Chemistry | General Science | Sciences",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Engineering%20Physics1.jpg?itok=RWjOVO5D",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Electronics and Biomedical Engineering",
    "Branch": " Life Sciences",
    "SimilarCourses": " Micro-Biology and Immunology Engineering | Genetic Engineering | Bio Engineering | Biochemical Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/2013/11/20/9-Electronics%20and%20Biomedical%20Engineering_0.jpg?itok=0Ztq7JbG",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Telecommunication",
    "Branch": " Electronics",
    "SimilarCourses": " Power Electronics | Electronics Product Design Technology | Electronics and Power Engineering | Electronics and Media Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Telecommunication.jpg?itok=lGUZdZwC",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Medical Electronics",
    "Branch": " Electronics",
    "SimilarCourses": " Power Electronics | Electronics Product Design Technology | Electronics and Power Engineering | Electronics and Media Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Medical%20Electronics1.jpg?itok=yJrMvCIN",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Naval Architecture and Marine Engineering",
    "Branch": " Marine",
    "SimilarCourses": " Naval Architecture and OceanEngineering | Marine Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Naval%20architecture%20and%20marine%20engineering.jpg?itok=NsVwfoUA",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Naval Architecture and OceanEngineering",
    "Branch": " Marine",
    "SimilarCourses": " Naval Architecture and Marine Engineering | Marine Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Naval%20Architecture%20and%20Ocean%20Engineering.jpg?itok=8vuJZyRq",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Food and Biochemical Engineering",
    "Branch": " Food",
    "SimilarCourses": " Food Processing and Technology | Food Technology | Dairy Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Food%20and%20Biochemical%20Engineering2.jpg?itok=5uzL0bGz",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Textile Technology",
    "Branch": " Textile",
    "SimilarCourses": " Textile Engineering | Carpet and Textile Technology | Man Made Fiber Technology | Textile Production",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Textile-Technology2.jpg?itok=4hQz7pum",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Industrial Engineering",
    "Branch": " Production",
    "SimilarCourses": " Production Engineering and Management | Industrial Design | Production Engineering | Industrial and Production Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Industrial%20Engineering.jpg?itok=1U-CWZ5I",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Production Engineering and Management",
    "Branch": " Production",
    "SimilarCourses": " Industrial Engineering | Industrial Design | Production Engineering | Industrial and Production Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Production-Engineering-and-Management2.jpg?itok=6ePejTy1",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Production Engineering",
    "Branch": " Production",
    "SimilarCourses": " Production Engineering and Management | Industrial Engineering | Industrial Design | Industrial and Production Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/2013/11/20/5-Production%20Engineering_0.jpg?itok=UA9toX0E",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Systems Science Engineering",
    "Branch": " Others",
    "SimilarCourses": " Plastic Engineering | Water Management | Rubber Technology | Silk Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/2013/11/20/23-Systems%20Science%20Engineering_0.jpg?itok=I-e30Uj-",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Mineral Engineering",
    "Branch": " Mining",
    "SimilarCourses": " Mining Machinery Engineering | Mining Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Mineral%20Engg.jpg?itok=tACvyz-O",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Instrumentation Technology",
    "Branch": " Instrumentation",
    "SimilarCourses": " Instrumentation and Control Engineering | Instrumentation Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Instrumentation-Technology1.jpg?itok=BroKMMEd",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Textile Chemistry",
    "Branch": " Textile",
    "SimilarCourses": " Textile Engineering | Carpet and Textile Technology | Man Made Fiber Technology | Textile Production",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/2015/01/23/Textile%20Chemistry%20.jpg?itok=KFjw4xub",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Plastic Engineering",
    "Branch": " Others",
    "SimilarCourses": " Systems Science Engineering | Water Management | Rubber Technology | Silk Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Plastic%20Engineering.jpg?itok=iVZMBhFj",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Safety and Fire Engineering",
    "Branch": " Others",
    "SimilarCourses": " Systems Science Engineering | Plastic Engineering | Water Management | Rubber Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Safety%20and%20Fire%20Engineering1.jpg?itok=-f6SomMn",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Thermal Engineering",
    "Branch": " Thermal",
    "SimilarCourses": "",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Thermal%20Engineering.jpg?itok=y5NqaGio",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Geosciences and Remote Sensing",
    "Branch": " Geotechnical",
    "SimilarCourses": " Geotechnical Engineering | Geo informatics",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Geosciences%20and%20Remote%20Sensing1.jpg?itok=TKp8augu",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Pharmaceutical Technology",
    "Branch": " Pharmaceutical",
    "SimilarCourses": " Pharmaceutical Management | Pharmaceutics | Pharmaceutical Regulatory Affairs | Pharmaceutical Biotechnology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Pharmaceutical%20Technology1.jpg?itok=r1lkBwbU",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Polymer Technology",
    "Branch": " Polymer",
    "SimilarCourses": "",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Polymer%20Technology.jpg?itok=eaoXnXNb",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Fashion and Apparel Engineering",
    "Branch": " Fashion",
    "SimilarCourses": " Fashion Technology | Fashion Design",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Fashion%20and%20Apparel%20Engineering.jpg?itok=CjWWwec6",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Manufacturing Engineering",
    "Branch": " Manufacturing",
    "SimilarCourses": " Manufacturing Process and Automation Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/all/themes/careers360_new/images/careers360-dumy.png",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Oil and Paint Technology",
    "Branch": " Petroleum",
    "SimilarCourses": " Paint Technology | Petroleum Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Oil%20and%20Paint%20Engineering.jpg?itok=nPrO7-WQ",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Materials Science and Technology",
    "Branch": " Others",
    "SimilarCourses": " Systems Science Engineering | Plastic Engineering | Water Management | Rubber Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Materials%20Science%20and%20Technology1.jpg?itok=TcPiZo-y",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Paint Technology",
    "Branch": " Petroleum",
    "SimilarCourses": " Oil and Paint Technology | Petroleum Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Paint%20Technology.jpg?itok=AdS3Bdy8",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Engineering Chemistry",
    "Branch": " General Science",
    "SimilarCourses": " Engineering Physics | General Science | Sciences",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Engineering%20Chemistry.jpg?itok=CaqUfyln",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Mining Machinery Engineering",
    "Branch": " Mining",
    "SimilarCourses": " Mineral Engineering | Mining Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Minign%20machinery%20engg.jpg?itok=nXxRJ-Ax",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Pulp and Paper Technology",
    "Branch": " Printing",
    "SimilarCourses": " Printing Graphics and Packaging | Printing and Packaging Technology | Printing Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Pulp%20and%20Paper%20Technology.jpg?itok=9WOfjad_",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Manufacturing Process and Automation Engineering",
    "Branch": " Manufacturing",
    "SimilarCourses": " Manufacturing Engineering",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Manufacturing%20Process%20and%20Automation%20Engineering1.jpg?itok=NXppjyH3",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Man Made Fiber Technology",
    "Branch": " Textile",
    "SimilarCourses": " Textile Engineering | Carpet and Textile Technology | Textile Production | Jute and Fiber Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Man%20made%20fiber%20technology.jpg?itok=nEcNqrtD",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Printing Technology",
    "Branch": " Printing",
    "SimilarCourses": " Printing Graphics and Packaging | Printing and Packaging Technology | Pulp and Paper Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Printing%20Technology1.jpg?itok=GJXuPwrh",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Carpet and Textile Technology",
    "Branch": " Textile",
    "SimilarCourses": " Textile Engineering | Man Made Fiber Technology | Textile Production | Jute and Fiber Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Carpet%20and%20Textile%20Technology.jpg?itok=DYO6ishI",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Rubber Technology",
    "Branch": " Others",
    "SimilarCourses": " Systems Science Engineering | Plastic Engineering | Water Management | Silk Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Rubber%20Technology1.jpg?itok=Sx4JhSyJ",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Printing and Packaging Technology",
    "Branch": " Printing",
    "SimilarCourses": " Printing Graphics and Packaging | Pulp and Paper Technology | Printing Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/2013/11/20/1-Printing%20and%20Packaging%20Technology_0.jpg?itok=eG_3jHIx",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Jute and Fiber Technology",
    "Branch": " Textile",
    "SimilarCourses": " Textile Engineering | Carpet and Textile Technology | Man Made Fiber Technology | Textile Production",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Jute%20and%20Fiber%20Technology2.jpg?itok=t3LB4luN",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Silk Technology",
    "Branch": " Others",
    "SimilarCourses": " Systems Science Engineering | Plastic Engineering | Water Management | Rubber Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Silk%20Technology.jpg?itok=2afbC8Oy",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Precision Manufacturing",
    "Branch": " Others",
    "SimilarCourses": " Systems Science Engineering | Plastic Engineering | Water Management | Rubber Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Precision%20Manufacturing1.jpg?itok=G4Xmg_IH",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Printing Graphics and Packaging",
    "Branch": " Printing",
    "SimilarCourses": " Printing and Packaging Technology | Pulp and Paper Technology | Printing Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Printing%20Graphics%20and%20Packaging1.jpg?itok=0-OPVUy9",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Sugar Technology",
    "Branch": " Others",
    "SimilarCourses": " Systems Science Engineering | Plastic Engineering | Water Management | Rubber Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Sugar%20Technology2.jpg?itok=V214S2jK",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Textile Production",
    "Branch": " Textile",
    "SimilarCourses": " Textile Engineering | Carpet and Textile Technology | Man Made Fiber Technology | Jute and Fiber Technology",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Textile%20Production1.jpg?itok=x7dKkVGw",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  },
  {
    "courseName": " Planning Engineering",
    "Branch": " Planning",
    "SimilarCourses": "",
    "ImgURL": "https://images.careers360.mobi/sites/default/files/styles/medium/public/Planning%20engg.jpg?itok=I7n-KACu",
    "CourseDef": "",
    "Eligibility": "",
    "Scope": []
  }
]